Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/access.po
Languages: de, fr

source: Access control
de: Zugriffskontrolle
fr: Contrôle d'accès

source: You can use access control in Effektif to restrict who can access a process, or specific tasks within a process. Processes and tasks default to public accessibility, which means that all users in the organization have access. When you configure access controls, you restrict access to specific users or groups.
de: Über die Zugriffskontrolle in Effektif können Sie einzuschränken, wer auf welche Prozesse und Aufgaben zugreifen kann. Standardmäßig sind alle Prozesse und Aufgaben öffentlich, sodass alle Nutzer in Ihrer Organisation uneingeschränkten Zugriff haben. Wenn Sie die Zugriffsrechte konfigurieren, schränken Sie damit den Zugriff auf bestimmte Nutzer oder Gruppen ein.

source: Restricting access to processes
de: Zugriff auf Prozesse einschränken
fr: Restreindre l'accès aux workflows

source: When you make a process private, you can grant five different permissions to users and groups.
de: Wenn Sie den Zugriff auf einen Prozess einschränken, können Sie fünf verschiedene Rechte an Nutzer und Gruppen vergeben.
fr: Avec un workflows privé, vous pouvez accorder cinq différentes autorisations aux utilisateurs et groupes d'utilisateurs.

source: *Edit process* - make changes to a process and publish new versions
de: *Prozess bearbeiten* - Sie können den Prozess verändern und neue Versionen veröffentlichen
fr: *Éditer le workflow* - apporter des modifications à un workflow et de publier de nouvelles versions

source: *Start process* - start new cases for the process
de: *Prozess starten* - legen Sie neue Fälle des Prozesses an
fr: *Démarrer le workflow* - Démarrer de nouveaux cas du workflow

source: *View process* - see the process in the list of processes
de: *Prozess ansehen* - sehen Sie sich den Prozess an ohne ihn ändern zu können
fr: *Voir le workflow* - Voir le workflow dans la liste des workflows

source: *Edit cases* - work on the process’ cases, by editing or completing tasks
de: *Fälle bearbeiten* - Sie können Änderungen an laufenden Fällen vornehmen und Aufgaben abschließen
fr: *Éditer des cas*- Travailler sur les cas du workflow, en éditant ou en complétant les tâches

source: *View cases* - see the cases for the process.
de: *Fälle ansehen* - Sie können die Fälle eines Prozesses einsehen.
fr: *Afficher les cas* - voir les cas du workflow.

source: You can use these access controls in several ways, to restrict how people work on processes. For example, use the permission:
de: Es gibt viele Möglichkeiten, wie Sie die Zugriffskontrolle nutzen können um einzuschränken, wie Leute an Prozessen arbeiten. Beispielsweise können Sie die Rechte wie folgt nutzen:
fr: Vous pouvez utiliser ces contrôles d'accès de plusieurs façons, pour restreindre la façon dont les gens travaillent sur les workflow. Par exemple, utilisez l'autorisation :

source: *Edit process*, granted to a group, to restrict process editing to experienced process modellers
de: *Prozess bearbeiten* kann einer Gruppe zugewiesen werden, die damit vertraut ist, wie man Prozesse modelliert
fr: *Éditer le workflow*, accordé à un groupe, pour restreindre l'édition de workflow à des modélisateurs de workflow expérimentés

source: *View process*, granted only to your own user, to hide incomplete or draft processes from other people while you create a first version
de: *Prozess ansehen* kann nur Ihnen zugewiesen werden, um einen Prozess für andere Nutzer auszublenden während Sie noch an ihm arbeiten
fr: *Voir le workflow*, accordé uniquement à vous, afin de masquer un brouillon ou workflow incomplet auprès des autres utilisteurs pendant que vous créez une première version

source: *Start process*, granted only to your own user, so that people with *View process* and *Edit process* permission can collaborate on process modelling but cannot start cases until you publish it
de: *Prozess starten* kann nur Ihnen zugewiesen werden, sodass Leute mit dem *Prozess ansehen* und *Prozess bearbeiten*-Recht mit Ihnen zusammen an einem Prozessentwurf arbeiten können, aber nicht versehentlich neue Fälle gestartet werden, bevor der Prozess fertig ist
fr: *Démarrer le workflow*, accordé uniquement à vous, afin que les utilisateurs avec les autorisations *Voir le workflow* et *Éditer le workflow* peuvent collaborer à la modélisation du workflow, mais ne peuvent pas démarrer des cas jusqu'à ce que vous le publiez

source: *Edit cases*, assigned to one group but not another, to allow the first group to work on cases, while the second group has visibility of work on cases that they cannot themselves collaborate on.
de: *Fälle bearbeiten* kann einer von zwei Gruppen zugewiesen werden, sodass die erste Gruppe an einem Fall arbeiten kann während die zweite Gruppe zwar den Fortschritt verfolgen, jedoch nicht aktiv in den Fall eingreifen kann.
fr: *Éditer des cas*, accordé à un groupe, mais pas un autre. Le premier groupe peut travailler sur des cas. Le second a tout de même de la visibilité sur les cas auxquels il ne peut pas collaborer.

source: *View cases*, assigned to a group, to restrict access to cases that contain sensitive information.
de: *Fälle ansehen* kann nur einer bestimmten Gruppe zugewiesen werden, sodass der Zugriff auf sensible Informationen eingeschränkt wird.
fr: *Afficher les cas*, accordé à un groupe, pour restreindre l'accès aux cas qui contiennent des informations sensibles.

source: To apply process restrictions, open a process and select *Details*.
de: Um die Zugriffskontrolle für Prozesse zu aktivieren, öffnen Sie einen Prozess und navigieren Sie in den Abschnitt *Details*.
fr: Pour appliquer des restrictions, ouvrez un workflow et sélectionnez l'onglet *Détails*.

source: On the *Process details* page, the *Options* tab has an *Access rights* section.
de: Auf der *Prozessdetails* Seite finden Sie den Abschnitt *Zugriffsrechte* im Reiter *Optionen*.
fr: La page *Détails* du workflow contient un onglet *Droits d'accès*.

source: Process details - access rights
de: Prozessdetails - Zugriffsrechte
fr: Détails du workflow - droits d'accès

source: Click the *Make this process private* button to configure access control.
de: Klicken Sie auf *Den Zugriff auf diesen Prozess einschränken* um die Zugriffsrechte zu konfigurieren.
fr: Cliquez sur le bouton *Rendre ce workflow privé* pour configurer le contrôle d'accès.

source: Configuring process access control
de: Zugriffsrechte konfigurieren
fr: Configuration du contrôle d'accès au workflow

source: You can now use the checkboxes to grant permissions to users and groups. Use the text box to search for additional users and groups, to add them to the table, so you can then grant access to them.
de: Mit Hilfe der Checkboxen können Sie Nutzern und Gruppen Rechte zuweisen oder entziehen. Wenn Sie neue Rechte für einen Nutzer oder eine Gruppe definieren möchten, können Sie das Suchfeld am unteren Ende der Liste dazu nutzen.
fr: Vous pouvez maintenant utiliser les cases à cocher pour accorder des autorisations aux utilisateurs et aux groupes. Utilisez la zone de texte pour rechercher des utilisateurs et des groupes supplémentaires, pour les ajouter à la liste, afin que vous puissiez ensuite leur accorder des accès.

source: Click the *Make this process public* to remove all access restrictions on the process.
de: Klicken Sie auf *Einschränkungen von diesem Prozess entfernen*, um jegliche Zugriffskontrollen von dem Prozess zu entfernen.
fr: Cliquez sur le bouton *Rendre ce workflow public* pour supprimer toutes les restrictions d'accès sur le workflow.

source: Restricting access to user tasks
de: Zugriff auf Aufgaben einschränken
fr: Restreindre l’accès aux tâches utilisateur

source: In the same way that you can restrict access to a whole process, you can also restrict access to individual user tasks in the process.
de: Sie können den Zugriff auf einzelne Aufgaben genau so einschränken, wie es bei Prozessen möglich ist.
fr: De la même façon que vous pouvez restreindre l'accès à l'ensemble d'un workflow, vous pouvez également restreindre l'accès aux tâches utilisateur individuelles dans le workflow.

source: When you make a user task private, you can grant two different permissions to users and groups.
de: Wenn Sie den Zugriff auf eine Aufgabe eingeschränkt haben, können Sie zwei verschieden Arten von Rechten vergeben.
fr: Lorsque vous rendez une tâche utilisateur privée, vous pouvez octroyer deux autorisations différentes aux utilisateurs et aux groupes.

source: *View task* - review the task and participate in discussion by adding comments
de: *Aufgabe ansehen* - Sie können die Aufgabe sehen und an Diskussionen teilnehmen, indem Sie Kommentare hinterlassen
fr: *Voir la tâche* - examiner la tâche et participer à la discussion en y ajoutant des commentaires

source: *Edit task* - change the task’s title, assignment and due date, and create subtasks.
de: *Aufgabe bearbeiten* - Ändern Sie den Titel, die Zuweisung, das Fälligkeitsdatum und fügen Sie Unteraufgaben hinzu.
fr: *Éditer la tâche* - modifier le titre de la tâche, l'affectation, la date d'échéance, et créer des sous-tâches.

source: Suppose you have a process that includes an approval, where someone from a *Managers* group must approve or reject a request from someone in the *Employees* group. You need to use the *Edit task* permission to restrict access to the approval user task, so that only managers can provide the approval.
de: Stellen wir uns einmal vor wir hätten einen Prozess der eine Freigabe beinhaltet. In diesem Prozess muss jemand aus der *Manager* Gruppe eine Anfrage von jemanden aus der *Angestellte* Gruppe freigeben. In diesem Fall müssten Sie das *Aufgabe bearbeiten* Recht so einschränken, dass nur Personen aus der *Manager* Gruppe es besitzen, sodass nur Sie die Aufgabe abschließen können.
fr: Prenons l'exemple d'une étape de validation dans un workflow, lors duquel un membre du groupe "Responsables" doit approuver ou rejeter une demande d'un membre du groupe "Employés" ; grâce aux autorisations, vous pouvez restreindre l'accès à la validation, afin que seuls les responsables puissent fournir l'approbation.

source: To apply user task restrictions, open a process and select the user task. In the user task configuration panel, select the *Access Rights* tab:
de: Um die Zugriffskontrolle für Aufgaben zu aktivieren, öffnen Sie einen Prozess und wählen Sie eine Aufgabe aus. Im Konfigurationsdialog wählen Sie den Reiter *Zugriffsrechte*.

source: User task access rights
de: Zugriffsrechte für Aufgaben

source: Click the *Define specific access* button to configure access control.
de: Klicken Sie auf *Spezifische Einschränkungen aktivieren* um den Zugriff zu konfigurieren.

source: Configuring user task access control
de: Konfiguration der Zugriffsrechte für eine Aufgabe
fr: Configuration du contrôle d'accès à la tâche utilisateur

source: You can now use the text box to search for users and groups, and use the checkboxes to grant permissions.
de: Sie können jetzt das Suchfeld am unteren Ende der Liste nutzen um weitere Nutzer und Gruppen mit spezifischen Zugriffsrechten auszustatten.
fr: Vous pouvez maintenant utiliser la zone de texte pour rechercher des utilisateurs et des groupes et utiliser les cases à cocher pour accorder des autorisations.

source: You can use access control in Signavio Workflow to restrict who can access a process, or specific tasks within a process. Processes and tasks default to public accessibility, which means that all users in the organization have access. When you configure access controls, you restrict access to specific users or groups.
fr: Vous pouvez utiliser le contrôle d'accès dans Signavio Workflow Accelerator pour restreindre les personnes qui peuvent accéder à un workflow, ou des tâches spécifiques dans un workflow. Par défaut, les workflows et les tâches sont publiques, ce qui signifie que tous les utilisateurs de l'organisation y ont accès. Lorsque vous configurez les contrôles d'accès, vous restreignez les accès à des utilisateurs ou à des groupes spécifiques.

source: To apply user task restrictions, open a process and select the user task. In the user task configuration panel, select the *Access Rights* tab. Click the *Define specific access* button to configure access control.
fr: Pour appliquer les restrictions de tâche utilisateur, ouvrez un workflow et sélectionnez la tâche utilisateur. Dans le panneau configuration de la tâches, sélectionnez l'onglet *Droits d'accès*. Cliquez sur le bouton *Définir les droits d'accès spécifiques* pour configurer le contrôle d'accès.
