Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/control-flow.po
Languages: de, fr

source: Control flow
de: Kontrollfluss
fr: Flux de contrôle

source: You use transitions, gateways and events to specify the processing order of the actions in a process.
de: Benutzen Sie Transitionen, Gateways und Ereignisse um festzulegen, wie die Aktionen in einem Prozess ausgeführt werden.
fr: Vous utilisez les transitions, les branchements et les événements pour spécifier l'ordre de traitement des actions dans un workflow.

source: Transition
de: Transitionen

source: Exclusive gateway
de: Exklusives Gateway
fr: Branchement exclusif

source: Here’s an example. Suppose you have a user task called ‘Review contract’, an exclusive gateway and the two user tasks ‘Print contract’ and ‘Update contract’:
de: Hier ein kleines Beispiel. Angenommen Sie haben eine Aktivität namens `Vertrag prüfen`, ein exklusives Gateway und zwei weitere Aktivitäten `Vertrag drucken` und `Vertrag updated`:

source: An exclusive gateway must have at least one incoming and two outgoing transitions
de: Ein exklusives Gateway muss mindestens eine eingehende und zwei ausgehenden Transitionen besitzen.
fr: Un branchement exclusif doit avoir au moins une transition entrante et deux transitions sortantes

source: You can easily change the text on the buttons. For example, change them to `Approve` and `Reject`:
de: Sie können den Text auf den Knöpfen leicht ändern. Nennen Sie diese zum Beispiel `Annehmen` und `Ablehnen`.
fr: Vous pouvez facilement modifier le texte sur les boutons. Par exemple, les remplacer par `Approuve`» et `Rejeter` :

source: Customized decision buttons
de: Benutzerdefinierte Entscheidungen
fr: Boutons de décision personnalisés

source: After starting a new case for this process, the `Review contract` task will have decision buttons:
de: Nachdem Sie einen neuen Fall gestartet haben, sehen Sie in der Aufgabe `Vertrag prüfen` die Entscheidungsknöpfe.
fr: Après avoir démarré un nouveau cas pour ce workflow, la tâche 'Vérification du contrat' aura des boutons de decision :

source: Task decision buttons
de: Entscheidungsknöpfe in der Aufgabe
fr: Boutons de décision d'une tâche

source: When adding form fields to the task before the exclusive gateway - `Review contract` in this example - the decision buttons are added to the form.
de: Wenn Sie ein Formular zu einer Aktivität direkt vor dem Gateway hinzufügen - `Vertrag prüfen` in diesem Beispiel - werden die Knöpfe für die Entscheidung automatisch an das Formular angehangen.

source: Automatic decision
de: Automatische Entscheidung
fr: Décision automatique

source: An automatic decision is an exclusive gateway that selects an outgoing transition based on conditions that you choose. For each transition, you can formulate a condition using workflow data. Transition conditions are evaluated in order, from top to bottom. The workflow engine will take the transition with the first condition that is true, using the current case’s field values.
de: Wenn Sie ein Gateway für eine automatische Entscheidung konfigurieren, trifft Effektif die Entscheidung für Sie basierend auf von Ihnen festgelegten Kriterien. Sie können für jede Transition festlegen unter welcher Bedingung Sie verwendet werden soll. Hierzu können Sie natürlich auch Daten aus dem Workflow heranziehen. Effektif wertet die Bedingungen hierbei von oben nach unten aus und nimmt die erste Transition bei der die Bedingung zutrifft.

source: Automatic decision condition editor
de: Editor für automatische Entscheidungen
fr: Éditeur de conditions de décision automatique

source: To specify a condition, start by selecting a field and a comparison operator. Enter either a static value in the input field on the right, or click the |binding-symbol| button to select another field.
de: Um eine Bedingung zu definieren, wählen Sie zunächst ein Feld aus dem Prozess an das Sie die Bedingung knüpfen möchten. Danach entscheiden Sie sich für die Art des Vergleiches. Zum Schluss haben Sie noch die Möglichkeit entweder einen statischen Wert, wie eine Zahl einzugeben oder das Feld mit einem anderen Wert aus dem Prozess zu vergleichen. Um dies zu tun, klicken Sie auf |binding-symbol|.
fr: Pour spécifier une condition, commencez par sélectionner un champ et un opérateur de comparaison. Entrez une valeur statique dans le champ d'entrée à droite ou cliquez sur le |binding-symbol| pour sélectionner un autre champ.

source: A condition can include multiple field value comparisons. To add more sub-conditions, click the button at the bottom of the list. You can also use the select field at the top to specify that either **all** conditions in the list must be true, or that it is enough for at least one of them to be true.
de: Eine Bedingung kann mehrere Felder beinhalten. Um mehr als einen Vergleich zu der Bedingung hinzuzufügen klicken Sie auf den Knopf am unteren Ende der Liste. In der Selektion oberhalb der Liste können Sie festlegen ob **alle** oder nur **einer** ihrer Vergleiche zutreffen müssen, damit die Bedingung zutrifft.

source: When a sub-condition is incompletely specified, evaluating the whole condition will fail and the transition will not be taken. The |warning-symbol| symbol indicates an incomplete sub-condition, while the |check-symbol| symbol indicates that the sub-condition is valid. Click either of these symbols to remove the sub condition from the list.
de: Wenn Sie einen Vergleich nicht komplett spezifiziert haben, macht dies die komplette Bedingung ungültig, was dazu führt, dass diese nie benutzt werden wird. Das |warning-symbol| Symbol weist Sie auf solche unvollständigen Vergleiche hin. Korrekte Vergleiche werden durch das |check-symbol| Symbol dargestellt. Um einen Vergleich zu entfernen klicken Sie auf das |warning-symbol| Symbol oder das |check-symbol| Symbol.

source: Default transition
de: Standard-Transition
fr: Transition par défaut

source: An automatic decision usually has a default transition. A default transition is a fallback mechanism: if none of the conditions evaluate to true, the default transition is taken.
de: Automatische Entscheidungen haben normalerweise eine Art `Plan B` für den Fall, dass keine Bedingung zutrifft.

source: The default transition
de: Die Standard-Transition
fr: La transition par défaut

source: To make a transition the default, select the ‘per default’ item in the selection field at the top.
de: Um eine Transition als Standard zu definieren, öffnen Sie die Selektion über den Bedingungen und wählen Sie `standardmäßig (wenn keine andere Transition gewählt werden kann)`.
fr: Pour effectuer une transition par défaut, sélectionnez l'élément ‘par défaut‘ dans le champ de sélection en haut.

source: Parallel Gateway
de: Paralleles Gateway
fr: Branchement parallèle

source: Use parallel gateways to model tasks that will be completed at the same time as each other, or one at a time but not in a particular order. To do this, you *fork* and *join* the sequence flow.
de: Mit parallelen Gateways können ausdrücken, dass Aktivitäten parallel bzw. in keiner bestimmten Reihenfolge ausgeführt werden sollen. Um dies zu realisieren müssen Sie den Sequenzfluss `teilen` und später wieder `zusammenführen`.

source: Forking
de: Sequenzfluss teilen

source: With a parallel gateway, you can fork execution into multiple, concurrent flows. When process execution arrives in a parallel gateway, a new individual execution flow is created for each of the gateway’s outgoing transitions. Let’s look at the following purchase order example:
de: Mit einem parallelen Gateway können Sie die Ausführung eines Sequenzflusses in mehrere, konkurrierende Flüsse aufteilen. Wenn die Prozessausführung an einem parallelen Gateway angekommen ist, werden eigenständige Flüsse für jede ausgehende Transition des Gateways erzeugt. Sehen wir uns dazu das folgende Beispiel an.

source: A parallel gateway example
de: Beispiel eines parallelen Gateways
fr: Un exemple de branchement parallèle

source: In this example, the parallel gateway will be activated when the `Enter purchase order` user task is completed. The parallel gateway will create two individual paths of execution. One will take the transition to `Receive payment` and create that user task. Meanwhile, the other will create the `Send goods` user task.
de: In diesem Beispiel wird das parallele Gateway aktiviert, wenn die Aufgabe `Bestellung eingeben` abgeschlossen ist. Das Gateway teilt nun den Sequenzfluss in zwei parallele Flüsse auf. Dies hat zur Folge, dass direkt beide Aufgaben `Bezahlung erhalten` und `Waren versenden` erstellt werden.

source: You can have as many outgoing transitions as you want. All destination tasks for those transitions will be started at once.
de: Sie können so viele ausgehenden Transitionen, wie Sie möchten erstellen. Alle Aufgaben, die einem parallelen Gateway folgen werden simultan gestartet.

source: Joining
de: Sequenzflüsse zusammenführen
fr: Fusionner

source: You also use a parallel gateway to join concurrent paths back together. In this case, the joining parallel gateway has more then one incoming transition. Workflow execution will wait at the gateway until as many execution flows arrive as it has incoming transitions. When the last concurrent flow arrives, the joining parallel gateway will activate and one execution flow will be created on the outgoing transition.
de: Um parallele Sequenzflüsse wieder zusammenzuführen verwenden Sie auch ein paralleles Gateway. Die Ausführung des Workflows wird an dieser Stelle warten bis alle parallelen Sequenzflüsse das Zusammenführende Gateway erreicht haben und erst dann den Workflow weiterführen.

source: To continue the previous example, extend the purchase order process to look:
de: Wir erweitern das vorherige Beispiel indem wir ein zusammenführendes Gateway und eine weitere Aktivität hinzufügen.
fr: Pour continuer l'exemple précédent, prolongez le workflow de commande d'achat :

source: A parallel gateway example with join
de: Beispiel eines zusammenführenden parallelen Gateways
fr: Un exemple de branchement parallèle avec fusion

source: In this example, `Archive purchase order` will only start after both `Receive payment` and `Send goods` are complete.
de: In diesem Beispiel wird `Bestellung archivieren` erst ausgeführt, wenn `Bezahlung erhalten` und `Waren versenden` abgeschlossen sind.

source: Default forking
de: Standardverhalten beim Teilen
fr: Division par défaut

source: By default, multiple outgoing transitions out of an action like a user task will be interpreted as parallel. Meaning that if you have multiple transitions out of a user task, all destination actions of those transitions will be performed concurrently. Let’s look at a simple example.
de: Wenn Sie eine Aktivität erstellen, der mehrere Sequenzflüsse folgen, so wird diese standardmäßig wie ein paralleles Gateway behandelt. Schauen wir uns dazu ein einfaches Beispiel an.

source: After `Send goods` completes, both tasks `Receive payment` and `Send goods` will be created immediate.
de: Nachdem `Bestellung eingeben` abgeschlossen wurde, werden sowohl `Bezahlung erhalten` und `Waren versenden` erstellt.

source: You can combine default forking with a parallel gateway for joining.
de: Sie können dieses Standardverhalten mit einem parallelen Gateway zum Zusammenführen kombinieren.
fr: Vous pouvez combiner la division par défaut avec un branchement parallèle pour fusionner.

source: Default merging
de: Standardverhalten beim Zusammenführen
fr: Fusion par défaut

source: When multiple transitions lead to a user task, the user task will be started for each execution flow that arrives there. This means that there is no implicit joining for parallel flows.
de: Falls mehrere Sequenzflüsse zu einer Aufgaben führen, wird diese Aufgabe für jeden Sequenzfluss gestartet. Das bedeutet, dass kein implizites Zusammenführen der Sequenzflüsse geschieht.

source: Parallel gateway issues
de: Fallstricke bei parallelen Gateways
fr: Problèmes avec les branchement parallèle

source: You will end up with problems if you loop back over parallel gateways. To avoid situations:
de: Vermeiden Sie Konstrukte in denen Sie einen Sequenzfluss über ein paralleles Gateway hinweg zeichnen. Beispiele hierfür sind:
fr: Vous rencontrerez des problèmes si les passerelles parallèles s'executent en boucle. Pour éviter les situations :

source: Undesirable loopback
de: Unerwünschte Schleife
fr: Boucle indésirable

source: and this:
de: und:
fr: et ceci :

source: To avoid these issues, think of all actions between forking and joining as a self-contained part of the process, such that no transitions should cross that scope.
de: Um solche Situationen zu verhindern stellen Sie sich alle Aktionen zwischen einem teilenden und zusammenführenden Gateway als abgeschlossenes System vor. Keine Sequenzflüsse sollten dieses System verlassen oder in dieses System hineinführen.

source: Start event
de: Start Ereignis
fr: Événement de début

source: A start event marks the start of a process. All process elements that do not have incoming transitions are considered start elements. Start events don’t have a direct connection to triggers. You can usually leave out start events if you want to create more consice diagrams.
de: Ein Start Ereignis markiert den Start eines Prozesses. In Effektif werden alle Aktionen, die keine eingehenden Transitionen haben als Start Ereignisse behandelt. Da Start Ereignisse in Effektif nicht mit den Prozessauslösern zusammenhängen, können Sie diese in der Regel weg lassen.

source: End event
de: Ende Ereignis
fr: Événement de fin

source: Like start events, end events are also optional. End events mark the end of an execution flow:
de: Ähnlich den Start Ereignissen sind auch die Ende Ereignisse optional. Ende Ereignisse markieren jeweils das Ende der Prozessausführung.

source: This is equivalent to:
de: Der oben abgebildete Prozess ist äquivalent zu dem folgenden Prozess.

source: No end event
de: Kein Ende Ereignis
fr: Pas d'événement de fin

source: An exclusive gateway in the process editor
de: Exklusives Gateway im Prozesseditor
fr: In Branchement exclusive dans l’éditeur de workflow

source: A parallel gateway in the process editor
de: Ein paralleles Gateway im Prozesseditor
fr: Un branchement parallèle dans l'éditeur de workflow

source: A start event in the process editor
de: Ein Start Ereignis im Prozesseditor
fr: Un événement de début dans l’éditeur de workflow

source: An end event in the process editor
de: Ein Ende Ereignis im Prozesseditor
fr: Un événement de fin dans l’éditeur de workflow

source: Use an exclusive gateway to make a choice between multiple execution paths. The exclusive gateway selects one of the outgoing transitions, and only continues execution on that transition. There are two ways to configure an exclusive gateway: with a *manual decision* or an *automatic decision*.
de: Mit einem exklusiven Gateway können Sie eine Entscheidung innerhalb eines Prozesses ausdrücken. Diese Art von Gateway wird maximal eine der ausgehenden Transitionen verfolgen. In Effektif können Sie ein exklusives Gateway als `manuelle Entscheidung` oder `automatische Entscheidung` konfigurieren.

source: Manual decision
de: Manuelle Entscheidung
fr: Décision manuelle

source: Use a manual decision for an exclusive gateway when a person must make a decision. The previous action must be a user task, which will include making the decision. The user interface presents the decision to the user as buttons on the user task form.
de: Wenn eine Person die Entscheidung treffen soll, dann verwenden Sie die `manuelle Entscheidung`. In diesem Fall muss direkt vor dem exklusiven Gateway ein User Task vorhanden sein. Im Nutzerinterface wird die Entscheidung in Form von mehreren Knöpfen für den Nutzer dargestellt.

source: Select the exclusive gateway. Manual decision is the default type. After creating the elements and connecting them, as above, the exclusive gateway will be configured:
de: Wenn Sie ein exklusives Gateway erstellen wird dieses Standardmäßig als `manuelle Entscheidung` erstellt. Nutzen Sie den Konfigurationsdialog um weitere Einstellungen vorzunehmen.

source: Default manual decision configuration
de: Standardkonfiguration als `manuelle Entscheidung`
fr: Configuration par défaut de la décision manuelle

source: Manual decision variable
de: Variable für die manuelle Entscheidung
fr: Variable de la décision manuelle

source: Adding a manual decision to a process also creates a :ref:`workflow variable <variables>`. You can use this to re-use the result of a decision later in the process, either to display the entered value on another form, or to use the value in an automatic decision’s condition.
de: Wenn Sie eine manuelle Entscheidung verwenden wird hierdurch auch automatisch eine :ref:`Variable <variables>` erstellt, die den Ausgang der Entscheidung festhält. Hierdurch können Sie das Ergebnis der Entscheidung später im Prozess nutzen.
fr: L'ajout d'une décision manuelle à un workflow crée également une :ref:`variable de Workflow <variables>`. Vous pouvez utiliser cette option pour réutiliser le résultat d'une décision ultérieurement dans le workflow, soit pour afficher la valeur entrée sur un autre formulaire, soit pour utiliser la valeur dans la condition d'une décision automatique.

source: During workflow execution, the variable’s value is set to the selected decision - the text on the decision button. In this example, the decision variable value is set to ‘Approve’ or ‘Reject’.
de: Während der Ausführung wird der Wert der Variable auf den Text des angeklickten Knopfes gesetzt. In unserem Beispiel ist das entweder `Annehmen` oder `Ablehnen`.

source: Decision variable values - ‘Approve’ or ‘Reject’
de: Werte für die Entscheidungsvariable - `Annehmen` und `Ablehnen`
fr: Valeurs de variables de decision - ’Approuver’ ou ’Rejeter’

source: The variable name is ‘Decision’, by default, or the name of the gateway if it has one. You can change the variable name on the process editor’s `Details` tab, in the `Field overview`.
de: Standardmäßig wird die Variable mit `Entscheidung` benannt. Sie können den Namen ändern, indem Sie das Gateway umbenennen. Alternativ können Sie den Namen auch im Reiter `Details` unter `Feldübersicht` ändern.

source: A transition is an arrow from a source element to a destination element in the :ref:`Process builder <process-builder>`. The transition specifies that the destination element is only ‘executed’ after the source element is completed. A transition is called a ‘sequence flow’ in BPMN.
de: Eine Transition wird im :ref:`Prozesseditor <process-builder>` als ein Pfeil abgebildet, der zwei Aktivitäten verbindet. Dies sagt aus, dass die Aktion, die Ziel der Transition ist nur dann ausgeführt wird, wenn die Aktion an der die Transition startet abgeschlossen wurde. In BPMN wird eine Transition als `Sequenzfluss` bezeichnet.

source: In order to use the decision you need to name the buttons which will represent the deicion. For each button, the label on the right indicates the next action in the process, which will be performed when the button is clicked. In this example, when the user clicks the decision button `Print contract`, the `Print contract` task is executed and the `Update contract` task will *not* be executed.
de: Um die Entscheidung zu verwenden, müssen Sie die Knöpfe, welche die verschiednen Optionen darstellen benennen. Für jeden Knopf wird rechts angezeigt welche Aktivität in diesem Fall ausgeführt werden würde. In unserem Beispiel wäre dies `Vertrag drucken`, wenn der Nutzer auf `Annehmen` klickt und `Vertrag updaten` wenn der Nutzer auf `Ablehnen` klickt.

source: The :ref:`process-builder` displays a transition an arrow from a source element to a destination element. The transition specifies that the workflow engine only ‘executes’ the destination element after completing the source element. BPMN calls a transition a ‘sequence flow’.
fr: Le :ref:`process-builder` affiche une flèche de transition d'un élément source vers un élément de destination. La transition spécifie que le moteur de workflow ‘exécute» uniquement l'élément de destination après avoir terminé l'élément source. BPMN appelle une transition un «flux de séquence».

source: Use an exclusive gateway to make a choice between multiple execution paths. The exclusive gateway selects one of the outgoing transitions, and only continues execution on that transition. You can configure an exclusive gateway with a *manual decision* or an *automatic decision*.
fr: Utiliser une branchement exclusif pour faire un choix entre plusieurs chemins d’exécution. Lbrqncheöent exclusive sélectionne une des transitions de sorties et ne poursuit l'exécution que sur cette transition. Vous pouvez configurer un branchement exclusif avec une *décision manuelle* ou une *décision automatique*.

source: Use a manual decision for an exclusive gateway when a person must make a decision. A user task must precede the gateway; this task includes making the decision. The user interface presents the decision to the user as buttons on the user task form.
fr: Utilisez une décision manuelle pour une branchement exclusif lorsqu'une personne doit prendre une décision. Une tâche utilisateur doit précéder le branchement; cette tâche comprend la prise de décision. L'interface utilisateur présente la décision à l'utilisateur en tant que boutons sur le formulaire de tâche de l'utilisateur.

source: Suppose you have a user task called ‘Review contract’, an exclusive gateway and the two user tasks ‘Print contract’ and ‘Update contract’:
fr: Supposons que vous ayez une tâche utilisateur appelée ‘Vérifier le contrat‘, in branchement exclusif et les deux tâches utilisateur ‘Impression du contrat‘ et ‘Mettre à jour le contrat‘ :

source: Select the exclusive gateway. Its type defaults to *manual decision*. After creating the elements and connecting them, as above, you have configured the exclusive gateway:
fr: Sélectionnez le branchement exclusif. Son type est par défaut est une *décision manuelle*. Après avoir créé les éléments et les avoir connectés, comme ci-dessus, vous avez configuré le branchement exclusif :

source: In order to use the decision you need to name the buttons which will represent the decision. For each button, the label on the right indicates the next action in the process, which Signavio Workflow will perform when someone clicks the button. In this example, when the user clicks the decision button `Print contract`, Signavio Workflow executes the `Print contract` task, but *not* the `Update contract` task.
fr: Afin d'utiliser la décision, vous devez nommer les boutons qui représenteront la décision. Pour chaque bouton, l'étiquette sur la droite indique l'action suivante exécutée par Signavio Workflow Accelerator lorsque quelqu'un clique sur le bouton. Dans cet exemple, lorsque l'utilisateur clique sur le bouton de décision ‘Imprimer le contrat‘ , Signavio Workflow exécute la tâche ‘Impression du contrat‘, mais *pas* la tâche ‘Mise à jour du contrat‘.

source: When the task before the exclusive gateway - `Review contract` in this example - has a form, the form includes the decision buttons.
fr: Lorsque la tâche avant le branchement exclusive -'Vérification du contrat' dans cet exemple- a un formulaire, le formulaire comprend les boutons de décision.

source: During workflow execution, selecting a decision sets the variable’s value to the selected decision - the text on the decision button. In this example, the decision variable has the value ‘Approve’ or ‘Reject’.
fr: Pendant l'exécution du workflow, la sélection d'une décision définit la valeur de la variable sur la décision sélectionnée - le texte sur le bouton de décision. Dans cet exemple, la variable de décision a la valeur `Approuver` ou `Rejeter`.
