Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/control-flow.po
Languages: de, fr

source: The variable has the name ‘Decision’, by default, or the name of the gateway if it has one. You can change the variable name on the process editor’s `Details` tab, in the `Field overview`.
fr: La variable porte le nom ‘Decision‘, par défaut, ou le nom du branchement s'il en a un. Vous pouvez modifier le nom de la variable dans l'onglet `Détails` de l'éditeur de workflow, sous la section `Aperçu des champs`.

source: An exclusive gateway that selects an outgoing transition based on conditions that you choose models an automatic decision. For each transition, you can formulate a condition using workflow data. The workflow engine evaluates transition conditions in order, from top to bottom. The workflow engine will take the transition with the first condition that evaluates to true, using the current case’s field values.
fr: Un branchement exclusif qui sélectionne une transition de sortie selon les conditions que vous choisissez modélise une décision automatique. Pour chaque transition, vous pouvez formuler une condition à l'aide des données du workflow. Le moteur de workflows évalue les conditions de transition de haut en bas. Le moteur de workflows prend la transition avec la première condition qui est respectée, en utilisant les valeurs des champs du cas en cours.

source: A condition can include multiple field value comparisons. To add more sub-conditions, click the button at the bottom of the list. You can also use the select field at the top to specify that either **all** conditions in the list must evaluate to true, or that at least one of them must evaluate to true.
fr: Une condition peut inclure plusieurs comparaisons de valeurs de champ. Pour ajouter d'autres sous-conditions, cliquez sur le bouton en bas de la liste. Vous pouvez également utiliser le champ de selection en haut pour spécifier que **une** ou **toutes** les conditions de la liste doivent être respectée.

source: If you do not completely specify a sub-condition, evaluating the whole condition will fail and the workflow engine will not follow the transition. The |warning-symbol| symbol indicates an incomplete sub-condition, while the |check-symbol| symbol indicates a valid sub-condition. Click either of these symbols to remove the sub-condition from the list.
fr: Si vous ne configurez pas complètement une sous-condition, l'évaluation de la condition entière échouera et le moteur de workflow ne suivra pas la transition. Le symbole |warning-symbol| indique une sous-condition incomplète, tandis que le symbole |check-symbol| indique une sous-condition valide. Cliquez sur l'un de ces symboles pour supprimer la sous-condition de la liste.

source: An automatic decision usually has a default transition. You use a default transition as a fallback mechanism: if none of the conditions evaluate to true, the workflow engine follows the default transition.
fr: Une décision automatique a généralement une transition par défaut. Vous utilisez une transition par défaut comme mécanisme de secours : si aucune des conditions n'est respectée, le moteur de workflow suit la transition par défaut.

source: In this example, completing the `Enter purchase order` user task activates the parallel gateway. The parallel gateway will create two individual paths of execution. One will take the transition to `Receive payment` and create that user task. Meanwhile, the other will create the `Send goods` user task.
fr: Dans cet exemple, l'exécution de la tâche utilisateur `entrer l'ordre d'achat` active le branchement parallèle. Le branchement parallèle va créer deux chemins d'exécution individuels. L'un prendra la transition vers `Réception du paiement` et créera cette tâche utilisateur. Entre-temps, l'autre créera la tâche utilisateur `Envoyer la marchandise`.

source: You can have as many outgoing transitions as you want. The workflow engine will create all destination tasks for those transitions at once.
fr: Vous pouvez avoir autant de transitions sortantes que vous le souhaitez. Le moteur de workflow va créer toutes les tâches correspondantes pour ces transitions.

source: You also use a parallel gateway to join concurrent paths back together. In this case, the joining parallel gateway has more then one incoming transition. Workflow execution will wait at the gateway until as many execution flows arrive as it has incoming transitions. When the last concurrent flow arrives, the joining parallel gateway will activate and the workflow engine will create one execution flow on the outgoing transition.
fr: Vous utilisez également un branchement parallèle pour joindre les chemins parallèle à nouveau ensemble. Dans ce cas, le branchement parallèle de fusion a plus d'une transition entrante. L'exécution de workflow attendra au branchement jusqu'à ce que l'ensemble des flux d'exécution y arrivent. Lorsque le dernier flux parallèle arrive, le branchement parallèle de fusion s'activera et le moteur de workflow créera un flux d'exécution sur la transition sortante.

source: In this example, `Archive purchase order` will only start after people complete both the `Receive payment` and `Send goods` tasks.
fr: Dans cet exemple, `Archiver l'ordre d'achat` ne démarrera qu'une fois que les personnes auront terminé les tâches `Réception du paiement` et `Envoyer les marchandises`.

source: By default, the workflow engine interprets multiple outgoing transitions from an action as parallel tasks. This means that if you have multiple transitions from a user task, the workflow engine will create concurrent tasks for all of the transitions’ destination actions. Let’s look at a simple example.
fr: Par défaut, le moteur de workflow interprète plusieurs transitions sortantes d'une action en tant que tâches parallèles. Cela signifie que si vous avez plusieurs transitions à partir d'une tâche utilisateur, le moteur de workflow créera des tâches parallèle pour toutes les actions de destination des transitions. Examinons un exemple.

source: After `Send goods` completes, the workflow engine will create the tasks `Receive payment` and `Send goods` immediately.
fr: Lorsque `Saisir l'ordre d'achat` est terminée, le moteur de flux de travail va créer immédiatement les tâches `Réception du paiement` et `Envoyer les marchandises`.

source: When multiple transitions lead to a user task, the workflow engine will start the user task once for each execution flow that arrives. This means that the workflow engine does not perform implicit joining for parallel flows.
fr: Lorsque plusieurs transitions mènent à une tâche utilisateur, le moteur de workflow démarre la tâche utilisateur une fois pour chaque flux d'exécution qui arrive. Cela signifie que le moteur de workflow n'effectue pas de fusion implicite pour les flux parallèles.

source: A start event marks the start of a process. All process elements that do not have incoming transitions act as start elements. Start events don’t have a direct connection to triggers. You can usually leave out start events if you want to create more concise diagrams.
fr: Un événement début marque le début d'un workflow. Tous les éléments de workflow qui n'ont pas de transitions entrantes agissent comme événements de début. Les événements de début n'ont pas de connexion directe avec les déclencheurs. Vous pouvez généralement ne pas utiliser les événements de début si vous voulez créer des diagrammes plus concis.

source: Like start events, you can also omit end events. End events mark the end of an execution flow:
fr: Comme les événements de débuts, vous pouvez également omettre les événements de fin. Les événements de fin marquent la fin d'un flux d'exécution :

source: Equivalently:
fr: Équivalent:

source: Intermediate timer event
fr: Événement intermédiaire de minuterie

source: An intermediate timer event in the process editor
fr: In événement intermédiaire de minuterie dans l'éditeur de workflow

source: An intermediate timer event indicates that process execution waits for a timer. You can use this to prevent Signavio Workflow creating the next task in a process until it becomes relevant.
fr: Un événement intermédiaire de minuterie indique que l'exécution du workflow est mise en attente. Vous pouvez l'utiliser pour empêcher Signavio Workflow Accelerator de créer la tâche suivante dans un workflow jusqu'à un moment pertinent.

source: Using an intermediate timer event to model an evaluation period
fr: Utilisation d'un événement intermédiaire de minuterie pour modéliser une période d'évaluation

source: Configure how long the timer waits by selecting the timer in the process editor.
fr: Configurez la durée d'attente de la minuterie en sélectionnant l'événement intermédiaire de minuterie dans l'éditeur de workflow.
