Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/data-types.po
Languages: de

source: Data types
de: Daten-Typen

source: The forms and some of the actions are linked to workflow data, called *variables*. Workflow variables are mostly created automatically, as when creating a new form field. Each variable has a data type. This section lists the data types variables can have.
de: Die Formulare und einige der Aktionen sind mit Workflow-Daten, Variablen genannt, verlinkt. Workflow Variablen werden meist automatisch erstellt, ähnlich wie bei der Erstellung eines neuen Formularfelds. Jeder Variable ist ein Datentyp zugeordnet. Dieses Kapitel listet die möglichen Datentypen der verschiedenen Variablen.

source: Workflow information is stored in variables. Each variable has a user-defined name and a type. A type can be a single value, like a string (text) or an email address. Other types like user, file or email are composite - consisting of several values. Composite types have a list of fields.
de: Workflow-Information wird in Variablen gespeichert. Jede Variable hat einen Namen und einen Typ. Typen können einzelne Werte sein, wie ein String (Text) oder eine Email-Adresse. Andere, zusammengesetzte Typen sind "Benutzer" "Datei" oder "Email", sie bestehen aus mehreren Werten. Zusammengesetzte Typen besitzen eine Werteliste.

source: When using expressions or configuring some action, references are made to workflow data. These can be references to variables, or to fields inside composite variables. The user interface guides you and shows the options you have.
de: Wenn Sie Aktionen konfigurieren oder Expressions verwenden, referenzieren Sie Workflowdaten. Dies können Referenzen zu Variablen selbst oder Referenzen zu Feldern innerhalb zusammengesetzter Variablen sein. Die Nutzeroberfläche hilft Ihnen bei dieser Auswahl und zeigt jeweils alle verfügbaren Optionen auf.

source: String type
de: String-Typ

source: The *String* type stores plain text.
de: Der *String*-Typ enthält Klartext

source: File type
de: Dateityp

source: The *file* type stores a file.
de: Der *File*-Typ enthält eine Datei

source: User type
de: Benutzertyp

source: A variable of type *user* refers to a user in your organization. A user is an object type with the following properties:
de: Variablen vom Typ *Nutzer* referenzierten Nutzer innerhalb Ihrer Organisation. Der Nutzer ist ein Objekttyp mit den folgenden Eigenschaften:

source: (:ref:`id <type-id>`) The unique identifier for this user
de: (:ref:`id <type-id>`) Der für diesen Nutzer einzigartige Identifikator

source: (:ref:`string <type-string>`) The user’s first name
de: (:ref:`string <type-string>`) Der Vorname des Nutzers

source: (:ref:`string <type-string>`) The user’s last name
de: (:ref:`string <type-string>`) Der Nachname des Nutzers

source: (:ref:`emailAddress <type-email-address>`) The email address of the user
de: (:ref:`emailAddress <type-email-address>`) Die Email-Adresse des Nutzers

source: Email address type
de: Email-Adress-Typ

source: The *email address* type stores an email address.
de: Der Typ *Email-Adresse* enthält eine Email Adresse

source: Email type
de: Email-Typ

source: The *email type* stores an email, and is used by the email trigger. The email that triggers the process will be stored as a variable. The data fields in the email, such as *from address* or the attachments can be used later on.
de: Der Typ *Email-Adresse* enthält eine Email und wird vom Auslöser "Email" verwendet. Die Email, die den Prozess anstößt, wird als Variable gespeichert. Die Datenfelder in der Email, wie *von Adresse* oder Anhänge, können später verwendet werden.

source: An email is a composite type with the properties:
de: Eine Email ist ein zusammengesetzter Typ mit folgenden Eigenschaften:

source: :ref:`id <type-id>`: The unique identifier for this email
de: :ref:`id <type-id>`: Der für diese Email einzigartige Identifikator

source: (:ref:`emailAddress <type-email-address>`) The sender email address
de: (:ref:`emailAddress <type-email-address>`) Die Email Adresse des Absenders

source: (:ref:`list <type-list>` of :ref:`emailAddress <type-email-address>`) The email addresses of the recipients
de: (:ref:`list <type-list>` of :ref:`emailAddress <type-email-address>`) Die Email Adressen der Empfänger

source: (:ref:`list <type-list>` of :ref:`emailAddress <type-email-address>`) Email addresses that receive a carbon copy of the message
de: (:ref:`list <type-list>` of :ref:`emailAddress <type-email-address>`) Die Email Adressen in CC

source: (:ref:`string <type-string>`) The subject of the email
de: (:ref:`string <type-string>`) Die Überschrift der Email

source: (:ref:`string <type-string>`) The plain text message
de: (:ref:`string <type-string>`) Die Klartext-Nachricht

source: (:ref:`string <type-string>`) The HTML code for an HTML email (optional)
de: (:ref:`string <type-string>`) Der HTML-Code für eine HTML-Email(optional)

source: (:ref:`list <type-list>` of :ref:`file <type-file>`) The files to attach to the email
de: (:ref:`list <type-list>` of :ref:`file <type-file>`) Dateien, die an die Email anzuhängen sind

source: ID type
de: ID-Typ

source: The ID type is a special kind of string. These IDs identify objects and they are always created by Signavio Workflow, and have no other meaning. An example of an ID string is ``53fae958036471cea136ea83``.
de: Der ID-Typ ist eine spezielle String-Art. Diese IDs identifizieren Objekte und werden von Signavio Workflow erstellt. Sie besitzen keinerlei Bedeutung für den Nutzer. Ein Beispiel dieser Art von String wäre "`53fae958036471cea136ea83".

source: Object types
de: Objekttypen

source: Object types are composite data types that have a list of fields. Each field has a name. For example: a user is an object type, with fields such as ``firstName``, ``lastName``, ``mailAddress``.
de: Objekttypen sind zusammengesetzte Dateitypen, die eine Liste von Feldern enthalten. Jedes Feld besitzt einen Namen. Zum Beispiel ist ein Benutzer ein Objekttyp mit Feldern wie "firstName", "lastName", "emailAddress".

source: When an action requires data, like the ``files`` in a `Google File Upload`, it’s possible to bind those input parameters to variables or fields inside variable objects.
de: Wenn eine Aktion einen Dateninput benötigt, wie die "Dateien" in einem 'Google File Upload', ist es möglich, diese Inputparameter an Variablen oder Felder in Variabel-Objekten zu binden.

source: List type
de: Listen-Typ

source: A list is simply a collection of values. The list is ordered and all elements are of a specified type.
de: Eine Liste ist eine einfache Sammlung von Variablen. Die Liste ist geordnet und für jedes Element ist ein Typ definiert.

source: Variables
de: Variablen
