Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/examples.po
Languages: de

source: replace the *Wait for available stock* task with an automated version that precedes the *Check purchase order* task, so that the order only gets a manual manual check once the stock is available
de: den Task *Auf Wareneingang warten* automatisieren, sodass eine manuelle Prüfung nur dann durchgeführt werden muss, sobald die Waren vorliegen.

source: perform the *Fulfil order* and *Issue invoice* tasks in parallel, depending on how exceptions in *Fulfil order* are handled
de: die Tasks *Produkte verschicken* und *Rechnung stellen* parallel ausführen

source: replace the order form file upload with separate form fields, using a list of text values for the order lines, with each order line - product code, description and quantity - in one text value.
de: ersetzen Sie das Uploadformular für die Bestellung durch mehrere Formularfelder des Typs 'Liste', wobei jeder Bestellposten - Produktcode, Beschreibung und Menge - einen Textwert ausmacht.

source: Hire Employee (HR)
de: Mitarbeiter einstellen (HR)

source: Send a job offer letter to a successful job applicant.
de: Das Prozessziel ist, einem erfolgreichen Bewerber ein Jobangebot zuzusenden.

source: Recruiting an employee requires a long elapsed time to complete - typically a couple of months - and involves a number of people. Unless very few people apply for jobs, the recruitment team will have to handle a large number of cases at the same time. This is a complex process whose tasks will be assigned to the different people who perform different tasks, such as interviewing or preparing a contract.
de: Die Recruitierung eines Mitarbeiters zieht sich in der Regel eine Zeit lang hin - oft über mehrere Monate - und setzt die Beteiligung verschiedenster Personen voraus. Häufig muss das Recruitment-Team eine hohe Anzahl an Bewerbungen gleichzeitig bearbeiten. Im Zuge eines Prozesses werden die verschiedenen Aufgaben - wie Interviews und Vertragsausarbeitung - jeweils von Spezialisten übernommen.

source: Form - for uploading the candidate’s CV.
de: Formular - für das Hochladen des Lebenslaufs des Bewerbers.

source: A recruitment process consists of a series of decisions, to reject the candidate or cointinue. This simplified process has these decision points after evaluating the applicant’s CV and a single interview.
de: Ein Bewerbungsprozess beinhaltet eine Reihe von Entscheidungen, die jeweils ein Fortfahren mit dem Bewerbungsprozess oder eine Ablehnung nach sich ziehen. In diesem vereinfachten Prozess sind Entscheidungen nach der Bewertung des Lebenslaufs und nach einem Interview notwendig.

source: If the hiring manager rejects the applicant at either stage, Effektif sends a standard rejection email.
de: Falls der Personalverantwortlicher die Bewerbung nach einer der Entscheidungen ablehnt, verschickt Effektif eine Standardemail, die die Ablehnung enthält.

source: *Hiring manager* - the person who takes responsibility for assessing a candidate and whether to reject the candidate or proceed: the *Evaluate CV* and *Interview candidate* tasks.
de: *Personalverantwortlicher* - Die Person, die den Lebenslauf evaluiert und das Interview durchführt und über eine etwaige Ablehnung entscheidet.

source: *Recruiter* - an HR assistant who coordinates the recruitment process: the *Plan interview* and *Send job offer* tasks.
de: *Recruiter* ein HR Assistent, der die Tasks *Interview planen* und *Jobangebot versenden* übernimmt.

source: *CV* (File, mandatory) - the applicant’s CV, provided by the trigger form.
de: *Lebenslauf* (Datei, Pflichtfeld) - der Lebenslauf des Bewerbers wird über das Auslöserformular bereitgestellt.

source: *Candidate email* (Email address, mandatory) - the email address that Effektif uses to send a rejection email.
de: *Emailadresse des Bewerbers* (Emailadresse, Pflichtfeld) - die Emailadresse, an die Effektif gegebenenfalls automatisch eine Ablehungsemail verschickt.

source: The trigger form could allow uploading additional documents, such as a covering letter, which some organisations like to receive.
de: Das Auslöserformular kann zudem das Hochladen weiterer Dokumente, wie zum Beispiel Anschreiben und Referenzen, erlauben.

source: Instead of a trigger form, use an e-mail trigger to accept applications by e-mail, including the CV as an attachment.
de: Anstelle eines Auslöserformulars kann ein Emailauslöser verwendet werden. Der Lebenslauf kann über den Anhang der Email übertragen werden.

source: If the organisation has to deal with a high case volume, the trigger form could capture information that could be used to prioritise cases, such as the *Candidate availability date*.
de: Falls Ihre Organisation sehr viele Bewerbungen bearbeiten muss, können Sie Felder zur Priorisierung im Formular bereitstellen, wie zum Beispiel das *Verfügbarkeitsdatum* des Bewerbers.

source: The trigger form could include additional information to allow automatic pre-screening, if there are situations that would mean that it’s not worth starting the process, such as no work visa.
de: Das Auslöserformular kann zudem weitere Felder zur Vorauswahl enthalten, zum Beispiel wenn ein valides Arbeitsvisum eine zwingende Voraussetzung ist.

source: You could add additional interview stages, such as a telephone screen, second interview, or a post-offer visit.
de: Desweiteren können Sie zusätzliche Interviews einführen, wie zum Beispiel ein Telefon-Screening, ein weiteres On-Site-Interview oder ein Kennenlerntreffen nach einem Angebot.

source: Initiate Project (project delivery)
de: Projekt initiieren (Projektmanagement)

source: Complete checklists that capture basic information when starting a new project.
de: Eine komplette Checkliste, die die Basisinformationen für einen neuen Projektstart enthält.

source: Manual.
de: Manuell.

source: This process represents a checklist with one user task for each piece of required project documentation. Each user task adds a level of detail by splitting these project initiation summaries into sections.
de: Der Prozess bildet eine Checkliste ab. Jeder Nutzertask entspricht der Beschaffung eines Informationsobjekts. Hierdurch wird die Projektbeschreibung in mehrere Abschnitte unterteilt.

source: The project manager can complete these tasks in any order.
de: Der Projektmanager kann die Tasks in einer beliebigen Reihenfolge abschließen.

source: *Project manager* - responsible for capturing the project summaries. In practice, the project manager may delegate these tasks to other team members, by assigning the user tasks.
de: *Projektmanager* - verantwortlich für die Erstellung der Projektbeschreibung. In der Praxis kann der Projektmanager diese Aufgaben delegieren, indem er die User Tasks seinen Mitarbeitern zuweist.

source: The *Project overview* task includes the following fields.
de: Der *Projektüberblick*-Task beinhaltet die folgenden Felder.

source: *Business context* (Text)
de: *Businesskontext* (Text)

source: *Goals* (Text, multiple values)
de: *Goals* (Text, Liste)

source: *Deliverables* (Text, multiple values)
de: *Deliverables* (Text, Liste)

source: Similarly, the *Project plan* task captures a summary for each of:
de: Der *Projektplan* enthält dementsprechend:

source: *Resources* (Text, multiple values)
de: *Ressourcen* (Text, Liste)

source: *Approach* (Text)
de: *Ansatz* (Text)

source: *Start date* (Date)
de: *Startdatum* (Datum)

source: *Success factors* (Text, multiple values)
de: *Erfolgsfaktoren* (Text, Liste)

source: *Risks* (Text, multiple values)
de: *Risiken* (Text, Liste)

source: You could simplify these forms by using *Yes/No* choices instead of text fields, turning each task into a checklist of its own. However, asking questions like *Do you have a project vision?* does not focus the mind as well as trying to write a well-formed sentence, which makes you think about about it the question more and forces you to prove that you have an answer.
de: Sie können die Formulare vereinfachen, indem Sie *Ja/Nein*-Felder anstelle von Textfeldern verwenden. So wird aus jedem Task eine Checkliste. Allerdings fördern offene Fragen eine tiefere Auseinandersetzung mit der entsprechenden Problematik, während Checklisten zum reflexartigen Abhaken einladen.

source: In general, you will extend this process with additional checklist tasks for work that is part of project initiation. You can extend this process to include a project approval task, based on the information given.
de: Sie können den Prozess natürlich um zusätzliche Tasks erweitern, die zur Projektinitiierung notwendig sind. Zudem können Sie eine Freigabetask anfügen.

source: Invoice Customer (finance)
de: Rechnung erstellen (Finanzen)

source: Get a customer invoice paid and closed.
de: Das Ziel ist es eine Rechnung zu versenden und den Zahlungseingang sicherzustellen.

source: In any business, the most obvious example critical process is getting paid by customers. This starts with sending invoices but also includes follow-up for outstanding invoices. This follow-up is usually necessary in practice, because customers cannot always be relied upon to pay on time.
de: Die Sicherstellung der Bezahlung durch Kunden ist ein wichtiger Prozess in jedem Betrieb. Der Prozess beginnt mit dem Versenden der Rechnung und beinhaltet Erinnerungen falls Rechnungen nicht direkt bezahlt werden.

source: Form - an uploaded invoice from a separate process, and customer contact details.
de: Forumlar - die Rechnungsdatei aus einem separaten Prozess sowie Kundenkontaktdaten.

source: This process uses a user task to capture key information about an invoice, which Effektif then sends automatically by e-mail. Another task checks for payment, with a due date based on the invoice payment terms.
de: Dieser Prozess nimmt die Rechnungsinformationen über einen User Task auf. Effektif verschickt die Rechnung anschließend automatisch per Email. Ein weiterer Tasks überprüft, ob die Rechnung zur festgelegten Deadline bezahlt wurde.

source: To reduce the number of unpaid invoices due to errors, this process starts with a *Check invoice* task. The assignee checks the information on the invoice, perhaps by comparing it to a purchase order, and then optionally replaces the invoice with a new corrected version.
de: Um Fehler zu vermeiden, wird der Task *Rechnung überprüfen* direkt nach Prozessstart ausgeführt. Als Überprüfungsgrundlage kann beispielsweise das Bestelldokument dienen. Fall notwendig wird die Rechnung durch eine korrigierte Version ersetzt.

source: The *Send Invoice* task automatically emails the invoice to the customer, and a *Check for payment* task requires the finance administrator to check for customer payment. If the customer has not paid by the invoice by the payment terms deadline, then Effektif sends a reminder email followed by a user task that uses daily reminders to chase the process.
de: Der *Rechnung senden*-Task schickt die Rechnung automatisch zum Kunden. Der Task *Zahlungseingang überprüfen* wird von einem Finanzadministrator ausgeführt. Falls der Kunde bis zur Deadline nicht bezahlt hat, verschickt Effektif automatisch eine Erinnerung und falls dieser nicht nachgekommen wird, wird der Vorgang zurück zum Finanzadministrator eskaliert.

source: *Finance administrator* - responsible for handling invoices within the company’s finance department.
de: *Finanzadministrator* - verantwortlich für die Verwaltung von Rechnung innerhalb der Finanzabteilung der Firma.

source: *Invoice* (File, mandatory) - produced by a separate process, typically a formatted PDF document.
de: *Rechnung* (Datei, Pflichtfeld) - generiert durch einen separaten Prozess und typischerweise im PDF-Format.

source: *Customer e-mail* (E-mail address) - for notifications
de: *Kundenemail* (Emailadresse) - für Benachrichtigungen

source: You may add a reminder email to the process, to prompt the customer to pay before the payment terms run out.
de: Sie können einen weiteren Task hinzufügen, um den Kunden schon kurz *vor* Ablaufen der Deadline zu erinnern.

source: Open New Customer Account (banking)
de: Neues Kundenkonto eröffnen (Banking)

source: Create a new customer bank account for a retail bank.
de: Das Prozessziel ist die Eröffnung eines Kundenkontos in einer Privatkundenbank.

source: Retail banking handles many high volume processes by standardising and optimising them, especially customer contact processes. Customer contact starts with opening a new account.
de: Im Privatkundenbanking ist es wichtig, die vielen high-volume Prozesse zu standardisieren und optimieren. Dies ist besonders wichtig, wenn Kundenkontakt Teil des Prozesses ist. Kundenkontakt startet hier mit der Eröffnung eines neuen Kontos.

source: This on-boarding business process has parallels in other service industries. A similar ‘new customer account’ process might apply to insurance products, local utilities or telecoms. In each case, a customer applies for the service and receives either a rejection, or a confirmation as well as (optionally) a ‘starter pack’.
de: Dieser Onboardingprozess weist Parallelen zu anderen Serviceindustrien auf. Ähnliche Prozesse können zum Beispiel im Versicherungs-, Telko- oder Energieversorgungsbereich existieren. In jedem Fall beantragt ein Kunde ein längerfristiges Dienstleistungsangebot und erhält entweder eine Absage oder eine Bestätigung und möglicherweise ein 'Starter Pack'.

source: Form - a completed customer application. The bank employee may use this information or additional documentation to reject the application.
de: Formular - ein ausgefüllter Kundenantrag. Der Bankangestellte kann dieses Dokument ablehnen oder bestätigen.

source: This process consists of a series of checks, followed by tasks to set-up a new account, if the bank employee approved the customer’s request for a new account.
de: Der Prozess besteht aus einer Reihe von Überprüfungen, gefolgt von Aufgaben die das neue Konto erstellen, falls der Antrag genehmigt wird.

source: This structure makes this process similar to other approval processes, including the rejection notification tasks. If the bank employee accepts the application, then the bank allocates a new account number and then performs a several account set-up tasks in parallel.
de: Von der Struktur her ähnelt der Prozess einem Freigabeprozess

source: *Bank employee* - responsible for the whole account creation process.
de: *Bankangestellter* - verantwortlich für den gesamten Kontoerstellungsprozess.

source: The process starts with initial information from the customer:
de: Zum Prozessstart liegen die folgenden Kundeninformationen vor:

source: *Customer name* (Text, mandatory)
de: *Kundenname* (Text, Pflichtfeld)

source: *Address* (Text, mandatory)
de: *Addresse* (Text, Pflichtfeld)

source: *Date of birth* (Date, mandatory)
de: *Geburtsdatum* (Datum, Pflichtfeld)

source: *Contact e-mail* (Email address, mandatory)
de: *Emailadresse* (Emailadresse, Pflichtfeld)

source: *Supporting documentation* (File, multiple values) - additional documents, such as proof of address, which might be specified individually.
de: *Nachweisdokumente* (Datei, Liste) - zusätzliche Dokumente wie Adressnachweis oder Kopie des Personalausweises.

source: Further information is added during the process, including:
de: Die folgenden weiteren Informationen werden im Laufe des Prozesses hinzugefügt:

source: *Account number* (Number) - created for the new account.
de: *Kontonummer* (Nummer) - wird für jedes neue Konto generiert.

source: A real retail bank’s workflow for creating a new customer account would include more tasks than this. In practice, back-office systems would automate many of the tasks, which means that the real complexity in this process comes from integrating with these existing systems.
de: Ein reeller Kontoeröffnungsworkflow einer Privatkundenbank würde selbstverständlich wesentlich komplexer ausfallen. In der Praxis werden viele Backoffice-Systeme viele Tasks automatisieren. Eine Integration mit diesen Systemen setzt zusätzliches IT-Know-How voraus.

source: Plan Trade Fair Booth (marketing)
de: Messestand planen (Marketing)

source: Have a stand at a trade fair.
de: Das Prozessziel ist ein eingerichteter Stand auf einer Fachmesse.

source: Attending a trade fair requires organisation far in advance of the event, with coordination between multiple people and a hard deadline. Checklists help ensure that staff do not forget critical tasks, while capturing dependencies between tasks helps staff manage timelines.
de: Wenn Sie als Firma auf einer Fachmesse ausstellen, ist eine frühzeitige Vorbereitung unumgänglich. Die Organisation des Events muss zwischen vielen verschiedenen Personen koordiniert werden und hat eine nicht verschiebbare Deadline. Checklisten helfen Angestellten, den Überblick über wichtige Aufgaben zu behalten. Zudem müssen Abhängigkeiten zwischen Aufgaben kontrolliert werden.

source: Getting this done requires expertise about which tasks to perform, how long they take, and their dependencies. That makes this process model more suitable for instruction purposes, than as a model for how the work really works in practice.
de: Dementsprechend ist genaues Wissen über die zu erledigenden Aufgaben und deren Länge und Abhängigkeiten zwischen einander notwendig. Daher ist das vorliegende Modell besser als Beispielsworkflow denn als praxisfähiger Workflow geeignet.

source: *Form* - specifies details of the trade fair booking.
de: *Formular* - Spezifika der Messebuchung

source: Sometimes there’s just a lot to do. This process consists of planning many activities, some of which can happen in parallel, but which may require long timelines.
de: Manchmal gibt es sehr viel zu tun. Dieser Prozess besteht aus vielen verschiedenen Aktivitäten - einige können parallel ausgeführt werden, während andere genau in den Zeitplan integriert werden müssen.

source: Every user task may have its own due date, reminders and escalation.
de: Jeder User Task benötigt ein eigenes Fälligkeitsdatum, eine Erinnerungsfunktion und eine Eskalationsmöglichkeit.

source: *Marketing team member* - responsible for the whole process.
de: *Marketingmitarbeiter* - verantwortlich für den gesamten Prozess.

source: The trigger form specifies trade fair booking details, including the fields:
de: Im Auslöserformular werden die folgenden Buchungsdetails festgelegt:

source: *Trade fair name* (Text, mandatory)
de: *Messename* (Text, Pflichtfeld)

source: *Address* (Text)
de: *Adresse* (Text)

source: *Booth location/number* (Text)
de: *Standortnummer des Stands* (Text)

source: *Start* (Date)
de: *Startdatum* (Datum)

source: *End* (Date)
de: *Enddatum* (Datum)

source: Each task can include its own checklist of requirements or subtasks. For example, the *Design booth* task might include the Yes/No fields for:
de: Jeder Task kann seine eigene Anforderungscheckliste oder Unteraufgaben enthalten. Der Task *Standdesign ausarbeiten* kann zum Beispiel Ja/Nein-Felder für die folgenden Punkte auflisten:

source: text content
de: Textinhalte

source: exhibition wall
de: Ausstellungswand

source: flyers
de: Flyer

source: brochures
de: Broschüren

source: posters.
de: Poster.

source: You could simplify this process by extracting design activities, so that this process requires an existing stand design. This might also simplify planning tasks.
de: In vielen Fällen können Sie auf ein bereits vorhandenes Standdesign zugreifen. Daher können Sie den Prozess vereinfachen, indem Sie die Designaktivitäten in einen anderen Prozess extrahieren. Hierdurch erleichtern Sie die Planung.

source: The basic version of this process does not rely on roles, on the assumption that team members know who does what. You might find it useful to define roles for different responsibilities, to automate some role assignment.
de: Die Basisversion des Prozesses verwendet keine Rollen und geht davon aus, dass Teammitglieder wissen, wer welche Aufgaben übernimmt. Allerdings ist es unter Umständen sinnvoll, Rollen zu definieren und die Zuweisung der Aufgaben zu automatisieren.

source: Process Claim (insurance)
de: Versicherungsfall bearbeiten (Versicherungen)

source: Process an insurance claim in order to make a payout to a customer
de: Das Prozessziel ist die Bearbeitung eines Versicherungsfalls mit anschließender Auszahlung an den Kunden.

source: Sometimes, a large team has to collaborate on high-volume task processing, such as assessing insurance claims.
de: Oft bearbeitet ein großes Team high-volume Tasks wie bei der Bearbeitung eines Versicherungfalls.

source: Form - an insured customer’s completed claim form.
de: Formular - ausgefülltes Fallformular eines Versicherungskunden.

source: This process illustrates how to handle large case volumes, by splitting the process into tasks that can be assigned to different groups of people, so junior staff handle most tasks and only hard tasks are assigned to a smaller group of senior staff.
de: Der Prozess illustriert wie ein hohes Fallaufkommen verwaltet werden kann indem der Prozess in Task eingeteilt wird, die verschiedenen Personengruppen zugewiesen kann. So können Juniormitarbeiter die meisten Tasks schnell abarbeiten, während Seniormitarbeiter lediglich komplizierte und risikoreiche Aufgaben übernehmen.

source: In most cases, the top row of user tasks will process the claim. Only a few claims will require the *Investigate high-value claim* or *Process complex claim* tasks.
de: Die meisten Fälle durchlaufen lediglich die oberste Taskreihe. Nur die wenigen komplexen Fälle und Fälle mit hohen Forderungssummen erfordern die Tasks *Forderung überprüfen* und/oder *Komplexe Forderung bearbeiten*.

source: *Junior claims adjuster* - triages insurance claims and processes the straightforward ones.
de: *Juniorfallbearbeiter* - stuft den Antrag ein und bearbeitet einfache Fälle.

source: *Investigator* - investigates high-value claims to protect against fraudulent claims.
de: *Prüfer* - prüft hohe Forderungen, um Betrugsfälle zu vermeiden.

source: *Senior claims adjuster* - processes complex claims.
de: *Seniorfallbearbeiter* - bearbeitet komplexe Fälle.

source: *Claim form* (File, mandatory) - the form provided by the customer, via the trigger form.
de: *Antragsformular* (Datei, Pflichtfeld) - das vom Kunden ausgefüllte Formular, das über den Auslöser bereit gestellt wird.

source: *Total value* (Money, mandatory) - the total value of the claim, which the junior adjuster extracts from the claim form in the *Calculate claim value* task.
de: *Gesamtsumme* (Geldbetrag, Pflichtfeld) - die Gesamtsumme des Antrags, die der Juniorfallbearbeiter aus dem Formular extrahiert.

source: *Payout* (Money, mandatory) - the amount to pay to the customer if the adjuster approves the claim.
de: *Auszahlung* (Geldbetrag, Pflichtfeld) - der Geldbetrag, den der Kunde bei stattgegebenem Antrag erhält.

source: Respond To Email (customer service)
de: Antwort verfassen (Kundenservice)

source: Respond to a (potential) customer’s email enquiry by sending an email reply.
de: Beantwortung der Anfrage eines (potentiellen) Kunden via Email.
