Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/examples.po
Languages: de

source: Companies often have a contact email address on their web site, like *info@example.com*, that routes customer email to a mailing list that several employees subscribe to. These people have to coordinate so that precisely one person responds to incoming mail in a timely manner. Attempting to do this solely by using email tends to result in ignored emails that ‘someone’ will probably reply to, or double replies when two people pick up the enquiry at the same time.
de: Oft haben Firmen eine Kontakt-Emailadresse auf ihrer Website, zum Beispiel *info@example.com*. Von dieser Adresse werden die Emails an eine Mailingliste weitergeleitet, die bestimmte Mitarbeiter abonniert haben. Diese Mitarbeiter müssen die Beantwortung von Kundenmails koordinieren, sodass genau ein Mitarbeiter eine eingehende Anfrage *zeitgemäß* beantwortet. Falls die Koordination ausschließlich über Email oder direkte Kommunikation erfolgt, führt dies typischerweise zu Chaos: Nicht beantworteten Anfragen oder mehrfachen und im schlimmsten Fall widersprüchlichen Antworten.

source: Email - a customer request.
de: Email - eine Kundenanfrage.

source: Unusually, this process consists of a single user task - for responding to the email - followed by an email task to send the reply.
de: Ungewöhnlicherweise besteht dieser Prozess aus lediglich einem User Task - dem Beantworten der Email - auf den ein *Email senden*-Task zum automatischen Versenden der Mail folgt.

source: This process is a minimal example for demonstrating the value of task assignment. The process’ value comes from the automated notifications from setting the user task’s candidate group, due date, reminders and escalation.
de: Bei diesem Prozess handelt es ich um eine Minimalversion, die den Nutzen von Taskzuweisungen demonstrieren soll. Der Wert des Prozesses kommt von den automatischen Benachrichtigungen durch das setzen der Kandidatengruppe, Erinnerung, Fälligkeitsdeadline und Eskalationsmöglichkeit des User Task.

source: A simpler version of this process only has a single user task, and relies on the assignee to send the email normally.
de: Eine einfachere Version dieses Prozesses hat lediglich einen Nutzertask. Es ist notwendig, dass die verantwortliche Person die Email manuell versendet.

source: Ship Product From Warehouse (logistics)
de: Produkte aus Lager versenden (Logistik)

source: In a warehouse operation, fulfil an order by shipping physical products to the customer.
de: Im einem Lager wird eine Bestellung durch das Verschicken physischer Produkte bearbeitet.

source: A product manufacturer typically runs warehouses that contain an inventory of products, ready to be shipped to customers. In the warehouse is where, a customer order - initially just information - results in physical activity and becomes associated with physical products.
de: Produkthersteller unterhalten typischerweise Lager, die das Produktinventar enthalten. Im Lager wird aus der bisher informationszentrierte Bestellprozess mit physischen Aktivitäten und Produkten verbunden.

source: This process is a subprocess in a broader customer order process that happens in the context of a warehouse. This may be orchestrated by the order status that triggers the process, and the order status that results from process completion.
de: Dieser Prozess ist ein Subprozess in einen breiter angelegten Bestellprozess, der im Kontext eines Lagers ausgeführt wird. Der Prozess wird durch den Bestellstatus bestimmt, der den Prozess auslöst und bei Prozessabschluss entsprechend geändert wird.

source: *Form* - an order form that lists order lines for the products to ship.
de: *Formular* - ein Bestellformular, das die bestellten Produkte auflistet.

source: The process takes a customer order and ships physical inventory from a warehouse. Warehouse staff retrieve the order and perform a sequence of tasks before actually shipping the parcels.
de: Der Prozess nimmt eine Kundenbestellung an und verschickt die Produkte aus einem Lagerinventar. Vor dem Versenden werden die Produkte von Lagermitarbeitern abgeholt, verpackt und weiter bearbeitet.

source: A long sequence of tasks characterises this process, as follows.
de: Diesen Prozess charakterisiert eine lange Folge von Tasks:

source: *Retrieve customer order* - retrieve the order from the order management system and make it available to warehouse staff, e.g. by printing it or transferring to a work queue in a handheld device.
de: **Bestellung empfangen* - Bereitstellung der Bestellung aus dem Bestellverwaltungssystem für die Lagermitarbeiter - zum Beispiel Ausdrucken der Bestellung oder Übertragung auf die entsprechenden mobilen Endgeräte.

source: *Pick items* - for each order line, finding the items in the warehouse and adding them to a ‘basket’, possibly for multiple orders at once with an efficient planned route through the warehouse.
de: *Produkte aus dem Lage holen* - Hinzufügen aller Produkte der Bestellung zu einem 'Warenkorb', möglicherweise für mehrere Bestellungen gleichzeitig, um Laufwege effizient zu nutzen.

source: *Pack items into parcels* - efficiently pack items into standard parcels.
de: *Produkte verpacken* - Verpacken der Produkte in Standardpakete.

source: *Weigh parcels* - to capture parcel weight and dimensions, for the shipping label.
de: *Pakete wiegen* - Wiegen der Pakete und Feststellung der Ausmaße.

source: *Print shipping labels* - print and attached labels showing the customer delivery address and other information such as weight and dimensions.
de: *Paketbeschriftungen drucken* - Drucken und ankleben der Beschriftungen mit Lieferadresse und weitere Informationen wie Gewicht und Maße.

source: *Move to loading dock* - stack parcels ready to be loaded on the next truck. Inspect packing quality - quality control to check that parcels are packed correctly.
de: *Pakete zur Laderampe transportieren* - Stapeln der Pakete vor der Verladerampe. **Verpackungsqualität überprüfen** - stellen Sie die Qualität der Verpackung sicher.

source: *Check parcel count* - a ‘head-count’ to check that there are no missing parcels for each order.
de: *Paketanzahl überprüfen* - Sicherstellung, dass keine Pakete einer Bestellung fehlen.

source: *Load parcels on truck* - loading happens in a batch together with parcels for other orders, and may only happen once per day.
de: *Pakete verladen* - der Verladevorgang wird zusammen mit anderen Bestellungen als 'Taskstapel' durchgeführt - zum Beispiel lediglich einmal am Tag.

source: *Update order status* - record process completion in the order management system, which may trigger other processes such as invoicing the customer.
de: *Bestellungsstatus auf 'versandt' aktualisieren* -Dokumentation der Prozessabsolvierung im Bestellverwaltungssystem. Dies kann andere Prozesse, wie zum Beispiel das versenden einer Rechnung, auslösen.

source: *Adjust stock levels* - update the warehouse’s inventory management system.
de: *Lagerbestand aktualisieren* - Aktualisierung des Lagerinventars im entsprechenden IT-System.

source: *Send delivery instructions* - provide the transport company with the information they require to deliver the shipment.
de: *Lieferanweisung an Transporteur senden* - Versand der Lieferanweisungen an den Transporteur.

source: There is flexibility in the process, which warehouse staff are likely to use. Staff may perform might be performed tasks sequentially in practice, even though they could perform them in parallel. Staff may also batch multiple orders together at various steps, when there are waiting times such as waiting for the next truck to arrive at the warehouse.
de: Der Prozess bietet Flexibilität für die Lagermitarbeiter. Das Personal kann die Tasks nacheinander durchführen, obwohl sie im Prozess als strikt parallel modelliert sind. Mitarbeiter können zudem Prozessschritte für mehrere Bestellungen als 'Stapel' abarbeiten, falls es Wartezeiten gibt, zum Beispiel zwischen Lastwagenladungen.

source: *Warehouse operator* - responsible for operations in the warehouse, moving goods from stock to trucks for shipment.
de: *Lagermitarbeiter* - verantwortlich für die Warenbewegungen im Lagerhaus und das Beladen der Lastwagen.

source: *Order form* (File, required) - lists order lines of products to ship from the warehouse.
de: **Bestellformular* (Datei, Pflichtfeld) - listet die bestellten Produkte auf.

source: *Order reference* (Text, required) - extracted from the order form, uniquely identifies the order in Effektif.
de: *Bestellreferenz* (Text, Pflichtfeld) - aus dem Bestellformular extrahiert, identifiziert die Bestellung in Effektif.

source: To extend or enhance this process, you could:
de: Um den Prozess zu erweitern oder zu verbessern, können Sie

source: trigger the process from an external order management system, as a result of an order status change
de: triggern Sie den Prozess über eine externes Bestellungsverwaltungssystem als Ergebnis einer Änderung des Bestellstatus.

source: automate the *Retrieve customer order* and *Print shipping labels* tasks
de: automatisieren Sie den Task *Bestellung empfangen* und *Paketbeschriftungen drucken*

source: add information to *The Pick stock items* task, e.g. by scanning bar codes to record the picked items’ serial numbers
de: Fügen Sie weitere Informationen zum Task *Produkte aus dem Lager holen* hinzu, zum Beispiel indem die Seriennummer der geholten Produkte über einen Barcodescanner eingelesen wird

source: make the *Inspect packing quality* task optional or randomised..
de: gestalten Sie den Task *Verpackungsqualität* als optional oder zufällig.

source: In this process, transport runs on a fixed schedule: trucks are loaded with parcels for multiple orders. A different shipping process could arrange individual transport (e.g. by courier) for each order.
de: In diesem Prozess läuft der Versandprozess nach einem festgelegten Zeitplan ab: Lastwagen werden mit Paketen für mehrere Bestellungen beladen. Ein anderer Prozess könnte individuelle Lieferungen - zum Beispiel über einen Kurierservice - vorsehen.

source: Sign Contract (management)
de: Dokument unterzeichnen (Management)

source: Sign a document and archive the signed copy.
de: Unterzeichnet ein Dokument und archiviert die unterzeichnete Kopie.

source: *Manual* - the requester uploads a document to be signed.
de: *Manuell* - der Anfragende lädt ein Dokument zur Unterzeichnung hoch.

source: The core process consists of tasks for the signer to review the document and then sign it. Effektif then archives the signed document and notifies the requester.
de: Der Kernprozess besteht aus Tasks für den Unterzeichner zur Überprüfung und Unterzeichnung des Dokuments. Nach diesen Tasks archiviert Effektif das Dokument und informiert den Anfragenden.

source: This process includes three additional scenarios:
de: Dieser Prozess enthält die folgenden zusätzlichen Szenarios.

source: The signer requests that someone else sign the document, and reassigns the *Signer* role.
de: Der Unterzeichner bittet eine andere Person darum, das Dokument zu unterzeichnen und weist die Aufgabe dieser Person über die *Unterzeichner*-Rolle zu.

source: The signer requests a change to the document, and the requester gets a new task to update the document.
de: Der Unterzeichner fragt Änderungen an und der Anfragende erhält einen neuen Task, um das Dokument zu aktualisieren.

source: The signer declines to sign the document, and the requester is notified.
de: Der Unterzeichner verweigert die Unterschrift und der Anfragende wird benachrichtigt.

source: *Requester* - submits the document and makes any required corrections.
de: *Anfragender* - händigt das Dokument ein und arbeitet Änderungen ein.

source: *Signer* - responsible for deciding whether to sign the document, and adding the signature.
de: *Unterzeichner* - verantwortlich für die Unterzeichnung und formelle Freigabe des Dokuments.

source: *Original document* (File, mandatory) - the document to be signed.
de: *Orginaldokument* (Datei, Pflichtfeld) - das zu unterzeichnende Dokument.

source: *Change request* (Text, multiple values) - a correction or addition that the signer requests before signing.
de: *Änderungsanfrage* (Text, mehrere Werte) - Korrekturen oder Ergänzungen, die der Unterzeichner anfragt.

source: *Signed document* (File, mandatory).
de: *Unterzeichnete Dokumente* (Datei, Pflichtfeld)

source: You could simplify the process by removing one or more of the extra cases.
de: Sie können den Prozess vereinfachen, indem Sie einen oder mehrere der Zusatzfälle entfernen.
