Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/examples.po
Languages: de

source: Example processes
de: Beispielprozesse

source: This chapter describes a number of example processes.
de: In diesem Kapitel wird eine Reihe von Beispielprozessen beschrieben.

source: Approve Document (management)
de: Dokument Freigeben (Management)

source: Process goal
de: Prozessziel

source: Approve the submitted document, after optional revision rounds.
de: Das Prozessziel ist die Freigabe des eingereichten Dokuments, gegebenenfalls nach mehreren Revisionsdurchgängen.

source: Context
de: Kontext

source: Employees need to submit expense forms for their managers to approve, but if they all send them by e-mail it will be difficult for their managers to keep track. Employees typically submit an expense form in a spreadsheet file that lists expenses.
de: Mitarbeiter müssen Kostenabrechnungen von ihren Vorgesetzten abnehmen lassen. Wenn die Dokumente via Email gesendet werden, ist es jedoch schwer für die Vorgesetzten, den Überblick zu behalten. Mitarbeiter reichen die Kostenabrechnung typischerweise als Spreadsheet ein, in dem die Kosten aufgelistet sind.

source: Employees also prepare proposals and reports that require management sign-off before the author may distribute them. The frequently have trouble keeping track of the document versions during the process.
de: Zudem bereiten Mitarbeiter Dokumente wie Angebote und Vorschläge vor, die vom Management freigegeben werden müssen. Hierbei gibt es oft Komplikationen bei der Verwaltung der vielen Versionen der Dokumente.

source: Expense forms are a specific example of process documents. Business processes often use documents to capture a process milestone. Managers often use a document approval process to verify that other work is complete, usually by exchanging email with the document author. Use an Approve Document process when you need to keep track of a large number of approvals, or when you need a record of each approval (who and when).
de: Ausgabenformulare sind Beispiel für Prozessdokumente. Geschäftsprozesse verwenden Dokumente oft, um einen Prozessmeilenstein festzuhalten. Manager nutzen Freigabeprozesse oft, um sicherzustellen, dass bestimmte Arbeitsvorgänge abgeschlossen sind und kommunizieren daher oft über Email mit dem Verfasser des Dokuments. Verwenden Sie Dokumentenfreigabeprozesse, wenn Sie eine größere Anzahl an Freigaben verwalten müssen oder wenn Sie ein zentrales Register aller Freigaben benötigen.

source: Trigger
de: Auslöser

source: Form - the uploaded document and its author.
de: Formular - das hochgeladene Dokument und dessen Verfasser

source: Actions
de: Aktionen

source: The process centres on a *Review document* task, which results in a decision to either *Approve* or *Reject* the document. Rejecting the document creates an *Update document* task to update the document and provide a new draft before starting again.
de: Der Prozess ist um den *Dokument überprüfen*-Task, der eine *Freigabe* oder *Ablehnung* des Dokuments nach sich zieht. Auf eine Ablehnung folgt der Task *Dokument anpassen*. Hier ist der Verfasser gefragt. Er muss eine korrigierte Version des Dokuments zur Verfügung stellen.

source: Adding a due date and reminders to the user tasks can help minimise cycle times. Adding escalation to the *Review document* task helps avoid a delay when the reviewer is not available.
de: Durch das Hinterlegen eines Fälligkeitsdatums und durch die Konfiguration von automatischen Erinnerungen können Sie die Durchlaufzeit der User Tasks minimieren. Eine Eskalationsoption für den *Dokument überprüfen*-Task verhindert Verzögerungen, falls der ursprüngliche Reviewer nicht verfügbar ist.

source: Roles
de: Rollen

source: The two tasks correspond to two process roles.
de: Die zwei User Tasks entsprechen zwei verschieden Rollen.

source: *Reviewer* (optional) - makes the approval decision: often a manager or supervisor.
de: *Reviewer* - Trifft die Freigabeentscheidung: Oft ein Manager oder Vorgesetzter.

source: *Author* - prepares the document. If the trigger form assigns this role, then Effektif will automatically assign the *Update document* to the author and send a notification.
de: *Verfasser* - Bereitet das Dokument vor. Falls der Prozessauslöser die Rolle zuweist, setzt Effektif automatisch den Verfasser als verantwortliche Person für *Dokument anpassen*.

source: Fields
de: Felder

source: *Document* (File, mandatory) - the document to review. The author uploads the first version on the trigger form, followed by a new version each time Effektif creates a new *Update document* task.
de: *Dokument* (Datei, Pflichtfeld) - das freizugebende Dokument. Der Verfasser lädt die initial Version im Auslöserformular hoch. Für jeden *Dokument anpassen*-Task, den Effektif erstellt, wird eine neue Version bereitgestellt.

source: *Author* (User, mandatory) - used to assign the role and notify the author.
de: *Verfasser* (Nutzer, Pflichtfeld) - verwendet zur Rollenzuweisung und Benachrichtigung des Verfassers.

source: Extensions
de: Erweiterungen

source: The document’s readers may find it useful to have access to the document outside Effektif. The organisation may also require a backup. You could add an integration task to the process after the decision to approve the document, in order to archive or email the document.
de: Der Leser des Dokuments möchte möglicherweise außerhalb von Effektif Zugriff auf das Dokument haben. Sie können einen Integrationstask nach der Freigabe zum Prozess hinzufügen, der das freigegebene Dokument archiviert oder per Email versendet.

source: To archive the approved document, add a Google Drive or Box *Upload file* task. This saves a copy of the document for people to read, but they still need a notification that the approved version exists.
de: Fügen Sie für die Archivierung einen Google Drive oder Box *Datei hochladen*-Task hinzu. Hiermit wird eine Kopie des Dokuments für weitere Leser gespeichert. Allerdings benötigen die Leser noch eine Benachrichtigung um zu wissen, dass das entsprechende Dokument existiert.

source: An email task notifies the author and other stakeholders that the document has been approved. The email template can include any reviewer comments and attach the document. The organisation may also find it useful to broaden the document’s distribution by copying the email to a distribution list.
de: Ein *Email senden*-Task benachrichtigt den Verfasser und andere Stakeholder darüber, dass das Dokument freigegeben wurde. Das entsprechende Email-Template kann Kommentare des Reviewers enthalten und das Dokument anhängen. Unter Umständen kann es nützlich sein, die Email an eine Verteilerliste zu senden.

source: Related processes
de: Ähnliche Prozesse

source: :ref:`Approve Vacation Request <approve-vacation-request>` handles approving a form rather than a document.
de: :ref:`Urlaubsantrag genehmigen <approve-vacation-request>` behandelt die Freigabe eines Effektif-Formulars an Stelle eines Dokuments.

source: Approve Vacation Request (HR)
de: Urlaubsantrag genehmigen (HR)

source: Approve an employee’s planned vacation dates.
de: Das Ziel des Prozesses ist die Genehmigung eines Urlaubsantrags eines Mitarbeiters.

source: Employees need to request vacation dates, so that their managers can make sure that they don’t all go on vacation at the same time. Employees typically e-mail requests to a designated coordinator, who maintains a spreadsheet of requests. However, this generates a lot of e-mail, and fails when the coordinator is on vacation.
de: Mitarbeiter müssen Urlaubsdaten bestätigen lassen, damit die Vorgesetzten sicherstellen können, dass der Betrieb auch in der Feriensaison aufrechterhalten werden kann. Entsprechende Anfragen werden typischerweise via Email an den entsprechenden Koordinator geschickt, der die Anfragen in einem Spreadsheet verwaltet. Diese Vorgehensweise impliziert unstrukturierte Kommunikation und das manuelle Übertragen von Daten. Wenn der Koordinator nicht erreichbar ist, entstehen Probleme.

source: Vacation requests exemplify form based requests, where an employee requires an approval based on information whose structure is known in advance. An employee requesting vacation days for specific dates is perhaps the simplest example of human tasks that are co-ordinated between multiple people.
de: Urlaubsanfragen sind ein gutes Beispiel für Freigabeanfragen von Formularen, deren Struktur im Vorhinein feststeht. Die Anfrage von spezifischen Urlaubstagen ist eine der einfachsten Aufgaben, die im Unternehmensbetrieb zwischen mehreren Personen koordiniert werden muss.

source: Despite this process’ simplicity, the obvious spreadsheet plus e-mail approach leads to enough problems to make it worth using Effektif instead. In principle, it’s easy enough for one person to receive vacation requests by e-mail and maintain a spreadsheet, but this fails when this person is on vacation. This irony illustrates the need for notify a group about new unassigned tasks, so that several people can approve vacation requests between themselves.
de: Obwohl der Prozess relativ einfach ist, führt der 'Spreadsheet und Email'-Ansatz oft zu Problemen. Da eine ordentliche und effiziente Bearbeitung nur mit einem zentralen Koordinator möglich ist, entsteht ein Bottleneck, der im Falle der Abwesenheit des Koordinators zusätzlichen Kommunikationsaufwand und Koordinationsprobleme verursacht. Daher ist es sinnvoll, den Prozess über Effektif ordentlich zu strukturieren.

source: Form - the employee and the requested dates.
de: Formular - der Mitarbeiter und die Urlaubsdaten

source: The process consists of a user task for a decision. The email tasks inform the employee of the decision.
de: Der Prozess enthält einen User Task für eine Entscheidung. Die Email Tasks informieren den Mitarbeiter über die Entscheidung.

source: Adding a due date and reminders to the user task can help reduce cycle times.
de: Fügen Sie ein Fälligkeitsdatum zum User Task hinzu, um so kurze Durchlaufzeiten sicherzustellen.

source: *Manager* - approves the request.
de: *Manager* - genehmigt die Anfrage

source: *Employee* (User, mandatory) - the employee making the request. This, plus the other fields, should be enough information for the manager to make the decision.
de: *Mitarbeiter* (Nutzer, Pflichtfeld) - der Mitarbeiter, der die Anfrage stellt.

source: *Start date* (Date) - vacation start date.
de: *Startdatum* (Datum) - das Startdatum des Urlaubs

source: *End date* (Date) - vacation end date.
de: *Enddatum* (Datum) - das Enddatum des Urlaubs

source: You might extend the process with an additional task for the employee to provide additional information, or change the initial request, if the manager rejected the request. This would avoid the need for more cases than vacations, which would clutter the case view.
de: Sie können den Prozess mit einem zusätzlichen Task erweitern, um Vorgesetzten die Möglichkeit zu geben, weitere Informationen oder Änderungen anzufragen, falls die initale Urlaubsanfrage nicht genehmigt werden kann. Dies vermeidet, dass für jeden abgelehnten Urlaubszeitraum ein neuer Fall erstellt werden muss.

source: You could also extend this process with additional tasks to support what happens when the employee goes on vacation, such as assigning a person to take over their work.
de: Sie können den Prozess zudem um einen Task erweitern, der die Verantwortungsübergabe vor Urlaubsbeginn unterstützt.

source: :ref:`Approve Document <approve-document>` handles approving a document rather than a form.
de: :ref:`Dokument freigeben <approve-document>` behandelt die Freigabe eines Dokuments an Stelle eines Formulars.

source: Fill Job Vacancy (HR)
de: Offenen Stelle besetzen (HR)

source: Fill a vacant position within the organisation.
de: Besetzen Sie eine offene Stelle in der Organisation.

source: The :ref:`Hire employee <hire-employee>` process is driven by job applications, and is suitable for organisations where there are usually open positions and few applicants. However, some organisations have many applicants as soon as they advertise a vacancy, and can fill it easily. In this scenario, an internal requisition for a new position drives the process.
de: Der Prozess :ref:`Mitarbeiter einstellen <hire-employee>` wird von Bewerbungen ausgelöst und ist für Organisationen mit oft durchgängig offenen Stellen und relativ wenigen Bewerbern geeignet. Einige Organisationen bekommen viele Bewerbungen sobald eine Stelle ausgeschrieben ist und die Stelle kann daher schnell besetzt werden. In unserem Beispiel wird der Prozess von der Erstellung eines neuen Stellenprofils ausgelöst.

source: Form - describes a job requisition.
de: Formular - Beschreibt ein Stellenprofil

source: The core process consists of an approval for the requisition, followed by advertising the vacancy, interviewing candidates, and closing the vacancy.
de: Der Kernprozess besteht aus der Freigabe des Stellenprofils, gefolgt von der Veröffentlichung der Stellenausschreibung, dem Durchführen von Interviews und dem Schließen der Stellenausschreibung.

source: In addition, the vacancy is passed to one or more external recruiters, by email, who may also supply applicants. A second email notifies the recruiters when the vacancy has been filled.
de: Zudem wird die Stellenausschreibung per Email an einen oder mehrere externe Recruiter geschickt. Eine zweite Email informiert die Recruiter sobald die Stelle besetzt ist.

source: *Recruiter* - the internal HR employee who coordinates the recruitment process. The basic version of this process excludes the hiring manager, who participates in the :ref:`Hire Employee <hire-employee>` subprocess. This process also excludes the external recruiter or headhunter.
de: *Recruiter* - der interne HR-Mitarbeiter, der den Einstellungsprozess koordiniert. Die Basisversion des Prozesses berücksichtigt nicht den HR Manager, der im :ref:`Mitarbeiter einstellen <hire-employee>`-Subprozess mitwirkt, sowie externe Recruiter oder Headhunter.

source: The trigger form defines the following fields that make up the job requisition.
de: Das Auslöserformular legt die Felder fest, aus denen die Stellenbeschreibung besteht.

source: *Job title* (Text, required)
de: *Jobtittel* (Text, Pflichtfeld)

source: *Job description* (Text)
de: *Jobbeschreibung* (Text)

source: *Maximum salary* (Money)
de: *Maximalgehalt* (Geldbetrag)

source: *Replaces existing position* (Yes/No)
de: *Ersetzt besehende Position* (Ja/Nein)

source: *Requesting manager* (User)
de: *Verwantwortlicher Manager* (User)

source: Enhancements
de: Verbesserungen

source: To improve this process you could:
de: Zur Verbesserung des Prozesses können Sie:

source: extend the trigger form to include more structured information about the job vacancy
de: das Auslöserformular erweitern, sodass weitere strukturierte Informationen hinterlegt werden können

source: skip the initial requisition approval to simplify the process
de: die initiale Freigabe des Stellenprofils weglassen um den Prozess zu vereinfachen

source: elaborate the requisition approval with correction steps
de: die Freigabe des Stellenprofils um Korrekturschritte erweitern

source: do the *Publish vacancy on web site* task in parallel with other ways to announce the vacancy, such as advertising
de: den Task *Stellenausschreibung auf Website veröffentlichen* parallel zu weiteren Tasks ausführen, die die Ausschreibung über weitere Kanäle veröffentlichen.

source: expand the interview task to include the whole individual recruitment process, as in :ref:`Hire employee <hire-employee>`.
de: den Interview-Task erweitern, sodass er den gesamten Einstellungsprozess abbildet, wie unter :ref:`Mitarbeiter einstellen <hire-employee>` beschrieben.

source: Follow-up Contact (sales)
de: Follow-up von Geschäftskontakt durchführen

source: Develop a business contact into a sales opportunity.
de: Entwickeln Sie einen Geschäftskontakt zu einer Sales Opportunity

source: Sales managers often have a large number of meetings with both qualified prospects and ad hoc contacts. They may use triage to prioritise follow-up, in order to maximise the number of qualified leads. To do this, the sales manager might write on their new contact’s business card, after their first meeting, to indicate whether to follow up *now*, *later* or *never*. Responding *now* might mean requesting another meeting, while *later* could mean sending a friendly but non-committal response. Although a simple to do list application might provide enough functionality for this scenario, the benefit of using Effektif is that the case view provides a convenient place to collect more information about each contact, but without the complexity of a full-featured sales pipeline tool.
de: Salesmanager haben typischerweise viele Meetings mit sowohl qualifizierten Prospects als auch spontanen Kontaktpartnern. Daher ist es notwendig, eine Einstufung vorzunehmen, um die Nummer qualifizierter Leads zu maximieren. Traditionell geschieht diese Einstufung oft über Vermerke auf Visitenkarten. Zum Beispiel kann dort vermerkt werden, ob ein Follow-Up *jetzt*, *später* oder *nie* passieren soll. Der Einstufung entsprechend kann direkt ein Meeting vereinbart oder eine freundliche Email versendet werden. Effektif ermöglicht es, den Prozess zu strukturieren und die Fälle zentral zu verwalten - ohne dass es notwendig ist, ein komplettes Sales-Pipeline Tool zu erwerben und zu konfigurieren.

source: Form - specifies the contact’s name and contact details, or perhaps a scan of the business card.
de: Formular - spezifiziert den Kontaktnamen und Kontaktdetails oder möglicherweise einen Scan der Visitenkarte.

source: This process records the result of a business meeting by triaging contacts according to what follow-up they require.
de: Der Prozess dokumentiert das Ergebnis eines Geschäftsmeetings, indem es Kontakte den Follow-Up-Anforderungen entsprechend einstuft.

source: *Sales Manager* - member of a business development team. This is the only role, as this process does not include collaboration with team members.
de: *Salesmanager* - Mitarbeiter eines Business Development-Teams. Dies ist die einzige Rolle, da der Prozess keine Collaboration mit Kollegen erfordert.

source: The process data consists of whatever information the sales manager uses to triage the contact and follow up.
de: Die Datengrundlage des Prozesses basiert auf den Informationen, die der Salesmanager für die Einstufung und das Follow-Up benötigt.

source: *Contact name* (Text, required) - the name of the prospect - the potential customer.
de: *Kontaktname* (Text, Pflichtfeld) - der Name des potentiellen Kunden

source: *Telephone number* (Text) - the contact’s phone number, in case the sales manager doesn’t use an external address book.
de: *Telefonnummer* (Text) - die Telefonnummer des Kontakts, falls der Salesmanager kein externes Adressbuch verwendet.

source: *Job title, Company* (Text) - the contact’s job, which the sales manager might use to prioritise and triage the contact.
de: *Jobtittel, Firma* (Text) - der Job des Kontakts, den der Salesmanager möglicherweise bei der Einstufung berücksichtigt.

source: You could extend this process to include the next steps in the larger sales process, following the first sales meeting, such as a product demo.
de: Sie können diesen Prozess erweitern, sodass er die nächsten Schritte des Salesprozesses enthätl, zum Beispiel die Durchführung einer Produktdemo.

source: Setting up meetings might involve introducing a collaboration with a secretary. Similarly, a demo might requires collaboration with a product specialist.
de: Die Meetingsfindung kann Koordination mit einem Sekretär erfordern. Entsprechend kann die Demo die Zusammenarbeit mit einer Produktspezialistin voraussetzen.

source: Fulfil Purchase Order (sales)
de: Produktbestellung bearbeiten

source: Fulfil a customer’s purchase order, e.g by shipping a product, and issuing an invoice.
de: Das Prozessziel ist die Bearbeitung einer Kundenbestellung, also das Versenden der Produkte und die Ausstellung einer Rechnung.

source: The core activities of many companies are selling things to their customers and giving them what they are paying for. Different companies’ high-level processes have much in common, which forms a basis for a purchase order process. Meanwhile, variations between these companies, and their customers and products, result in different implementations.
de: Die Kernaktivitäten vieler Firmen sind der Verkauf und die Lieferung von Produkten zu Kunden. Die High-Level-Prozesse vieler Firmen sind sehr ähnlich, sodass es möglich ist, generische Prozessblaupausen zu erstellen. Natürlich können diese Blaupausen anschließend individuell implementiert werden, um den Unterschieden der Firmen, Produkten und Zielgruppen gerecht zu werden.

source: Form - provides the purchase order.
de: Forumlar - stellt die Bestellung dar.

source: In this process, an incoming purchase order form essentially triggers two tasks: *Fulfil order* and *Issue invoice*.
de: In diesem Prozess triggert eine Bestellung zwei Tasks: *Produkte verschicken* und *Rechnung stellen*.

source: To prevent an exception when the purchase order cannot be fulfilled due to lack of stock, the workflow starts with a check task and a waiting task. This *Wait for available stock* task uses reminders to prompt the user to check every day until the wait is complete, after which the order can presumably be accepted. The trigger form captures the customer e-mail address, so that rejecting the invoice with a rejection reason can use a :ref:`Send E-mail <send-email>` task to send a notification.
de: Um zu verhindern, dass im späteren Prozessverlauf ein Problem aufgrund von mangelndem Lagerbestand auftritt, wird zu Beginn abgefragt, ob die Produkte verfügbar sind. Der Task *Auf Wareneingang warten* triggert eine tägliche Überprüfung des Lagerbestandes, solange die bestellten Produkte nicht vorhanden sind. Da das Auslöserformular die Emailadresse des Kunden enthält, kann eine Ablehungsemail automatisch über einen :ref:`Email senden <send-email>`-Task verschickt werden.

source: *Warehouse operator* - a person who works in the warehouse and ships customer orders.
de: *Lagermitarbeiter* - eine Person, die die Produkte im Lager für den Versand vorbereitet

source: *Financial administrator* - a member of the finance team, who issues invoices.
de: *Finanzadministrator* - Mitarbeiter des Finanzteams, der die Rechnungen erstellt

source: *Purchase order* (File, required) - the complete order details, including order lines. Effektif forms don’t support tabular data, so you cannot enter order lines normally.
de: *Bestellung* - (Datei, Pflichtfeld) - die kompletten Bestellinformationen in tabellarischer Form. Da Effektif keine Tabellen unterstützt, können diese Informationen nicht direkt im Formular gepflegt werden.

source: *PO reference* (Text, required) - the purchase order reference, extracted from the purchase order itself, to identify the case in Effektif
de: *Bestellreferenz* (Text, Pflichtfeld) - die Bestellreferenz aus dem Bestelldokument, um den Fall in Effektif identifizieren zu können

source: *Customer email* (Email address, required) - used to send notifications.
de: *Kundenemail* (Emailadresse, Pflichtfeld) - um Benachrichtigungen zu versenden.

source: To extend this basic process, you could:
de: Um den Prozess zu erweitern, können Sie:

source: include the whole *Close customer invoice* process, replacing the final *Issue invoice* task, to make this an order-to-cash process
de: den kompletten *Kundenrechnung schließen*-Prozess miteinbeziehen (den *Rechnung stellen*-Task ersetzen), um so einen kompletten *Bestellung-zu-Einnahmen*-Prozess abzubilden.
