Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/forms.po
Languages: de, fr

source: Forms
de: Formulare
fr: Formulaires

source: In Effektif, you can use forms to enter information when you run a process. There are two places where you can use a form: form triggers and user tasks.
de: Sie können Formulare in Effektif benutzen um Daten einzugeben, während Sie einen Prozess ausführen. Formulare können einerseits in Aufgaben und als Auslöser verwendet werden.

source: Form triggers
de: Formulare als Auslöser
fr: Formulaire déclencheur

source: You use a :ref:`form trigger <form-trigger>` to set the values of :ref:`workflow variables <variables>` when you start a new case for a process.
de: Sie können einen :ref:`Formularauslöser <form-trigger>` benutzen um die Werte von :ref:`Variablen <variables>` zu setzen, wenn Sie einen neuen Fall anlegen.
fr: Vous utilisez :ref:`formulaire déclencheur<form-trigger>` pour définir les valeurs des variables de workflow lorsque vous démarrez un nouveau cas d'un workflow.

source: Starting a new case with a form trigger
de: Einen neuen Fall durch ein Formular starten
fr: Démarrage d'un nouveau cas avec un formulaire déclencheur

source: This form has a description (`Enter personal details`) and two fields. The icon next to the `Name` field label indicates that the field has an additional description.
de: Dieses Formular hat eine Beschreibung (`Bitte geben Sie die Details zu dieser Person ein`) und zwei Felder. Das Fragezeichen-Symbol neben `Name` zeigt, dass hier eine zusätzliche Beschreibung hinterlegt wurde.
fr: Ce formulaire contient une description (`entrer des informations personnelles`) et deux champs. L'icône située en regard de l'étiquette de champ `Nom` indique que le champ contient une description supplémentaire.

source: To add a form trigger to a process, use the process builder’s :ref:`Triggers <triggers>` page to select `When a form is submitted`.
de: Um ein Formular als Prozessauslöser zu verwenden, wählen sie im Prozesseditor unter :ref:`Auslöser <triggers>` `Per Formular`.
fr: Pour ajouter un formulaire déclencheur à un workflow, utilisez la page :ref:`déclencheurs <triggers>` du le générateur de workflow et sélectionnez `Quand un formulaire est soumis`.

source: User task forms
de: Formulare in Aufgaben
fr: Formulaires de tâche utilisateur

source: You use a :ref:`user task <user-task>` form to view and edit the values of :ref:`workflow variables <variables>`.
de: Sie können Formulare in :ref:`Aufgaben <user-task>` verwenden, um sich die Werte von :ref:`Variablen <variables>` anzeigen zu lassen und zu verändern.
fr: Vous utilisez un formulaire de :ref:`tâche utilisateur <user-task>` pour afficher et modifier les valeurs de :ref:`variables de workflow <variables>`

source: Viewing and editing values on a user task form
de: Werte in einem Formular zu einer Aufgabe
fr: Affichage et modification de valeurs sur un formulaire de tâche utilisateur

source: To add a user task form to a process, use the process builder’s :ref:`Actions <actions>` page to add a user task, and on the user task’s configuration panel, select the `Form` tab.
de: Sie können Formulare zu Aufgaben hinzufügen, indem Sie im Prozesseditor unter :ref:`Aufgaben <actions>` eine Aufgabe erstellen und in deren Konfiguration den Reiter `Formular` auswählen.
fr: Pour ajouter un formulaire sur une tâche utilisateur à un workflow, utilisez la page :ref:`Actions <actions>` pour ajouter une tâche utilisateur et, dans le panneau de configuration de la tâche, sélectionnez l'onglet `formulaire`.

source: Viewing form data
de: Formulardaten einsehen
fr: Afficher les données de formulaire

source: When you enter data in a form, it appears on the case view’s event stream:
de: Wenn Sie ein Formular ausfüllen erscheinen die eingegebenen Werte danach im Aktivitäts-Stream des entsprechenden Falls.
fr: Lorsque vous saisissez des données dans un formulaire, cela apparaît dans le flux d'événements de l'affichage du cas :

source: Form data in a case event stream
de: Daten im Aktivitäts-Stream
fr: Données du formulaire dans le flux des événements du cas

source: You can use the `forms` link at the top of event stream to only show form data.
de: Der Aktivitäts-Stream kann über die Filter am oberen Ende auch so eingeschränkt werden, dass nur Formulare angezeigt werden.
fr: Vous pouvez utiliser le bouton `Formulaires` en haut du flux d'événements, sous `Afficher seulement`, pour filtrer l'affichage des données des formulaires.

source: Using the form builder
de: Der Formulareditor
fr: Utilisation du générateur de formulaires

source: To create a form in the process editor, for a form trigger or user task, you use the form builder.
de: Immer wenn Sie ein Formular erstellen möchten, sie es als Auslöser oder innerhalb einer Aufgabe, werden Sie dazu unseren Formulareditor verwenden.
fr: Pour créer un formulaire dans l'éditeur de workflow, pour un formulaire déclencheur ou une tâche utilisateur, vous utilisez le générateur de formulaires.

source: The process editor’s form builder for a new empty form
de: Der Formulareditor mit einem leeren Formular
fr: Le générateur de formulaires de l'éditeur de workflow pour un nouveau formulaire

source: The `Description` section in the form builder is a text area that you can use to provide initial instructions to people who complete the form. Use can use Markdown to format the description, which makes it convenient to link to additional information, for example.
de: Um den Personen, die das Formular ausfüllen müssen ein wenig Hilfe oder Kontext zu geben, können Sie die `Beschreibung` im oberen Teil des Editors benutzen. Ihren Text können Sie mit Hilfe von Markdown formatieren, was es sehr leicht macht zum Beispiel Links zu weiterführenden Informationen zu hinterlegen.

source: The `Add a field` second contains a field types palette. Click one of the field types to add a field of that type to the form.
de: Im Bereich `Ein Feld hinzufügen` befindet sich die Palette von verfügbaren Formularfelder. Um ein Formularfeld hinzuzufügen klicken Sie einfach den entsprechenden Typ.
fr: Le second `ajouter un champ` contient une palette de types de champs. Cliquez sur l'un des types de champs pour l'ajouter au formulaire.

source: The `Reuse a field` section is a list of variables that have already been defined on other forms, such as a trigger form:
de: Über der Palette finden Sie eine Auswahl von bereits vorhanden Formularfeldern. Wenn Sie eins dieser Felder in Ihrem aktuellen Formular wiederverwenden möchten, können Sie es einfach in dieser Liste auswählen.

source: Adding an existing workflow variable to a form
de: Ein bereits vorhanden Feld wiederverwenden
fr: Ajout d'une variable de workflow existante à un formulaire

source: Adding an existing field to a form makes it possible to view or update existing information, such as a user task form that you use to complete information that’s missing from a trigger form.
de: Indem Sie ein bereits vorhandenes Feld wiederverwenden haben Sie die Möglichkeit eingegebene Daten einzusehen oder zu bearbeiten. So können Sie zum Beispiel Informationen nachtragen, die in einem Formular, durch dass ein Fall gestartet wurde nicht eingegeben wurden.

source: Configuring form fields
de: Formularfelder konfigurieren
fr: Configuration des champs de formulaire

source: When you add fields to a form, they are shown in a `Fields` section:
de: Wenn sie Formularfelder hinzufügen, werden diese im Bereich `Formularfelder`aufgelistet.

source: Configuring a form field in the process editor’s form builder
de: Konfiguration eines Formularfelds im Formulareditor
fr: Configuration d'un champ de formulaire dans le générateur de formulaires de l'éditeur de workflow

source: Select a field in the `Fields` section to open its configuration panel. The top row of the field configuration panel shows the field type label, the editable field name.
de: Klicken Sie auf ein Feld im Bereich `Formularfelder`, um dessen Konfiguration zu öffnen. Die oberste Zeile der Konfiguration zeigt die Beschriftung des Felds.
fr: Sélectionnez un champ dans la section `Champs` pour ouvrir son panneau de configuration. La première ligne en haut du panneau de configuration du champ affiche le type de champ et son nom, dans un champ modifiable.

source: To delete a field, click the delete button in the top-right corner, and click the confirmation tick mark button to confirm:
de: Um ein Feld wieder zu entfernen klicken Sie auf den Papierkorb in der oberen rechten Ecke der Konfiguration und bestätigen Sie die Aktion, indem Sie auf den rot hinterlegten Haken klicken.
fr: Pour supprimer un champ, cliquez sur le bouton supprimer dans le coin supérieur droit, puis cliquez sur le bouton de confirmation avec le symbole valider pour confirmer :

source: Deleting a form field
de: Ein Formularfeld löschen
fr: Suppression d'un champ de formulaire

source: The other field configuration properties are as follows.
de: Die weiteren Konfigurationsmöglichkeiten sind nachfolgend Beschrieben.

source: `Description` - an optional field description, shown via context-sensitive help icon
de: `Beschreibung` - Hinterlegen Sie eine ausführlichere Beschreibung zu dem Feld (optional)
fr: `Description` - in champ de description facultatif, affichée via l'icône d'aide contextuelle

source: `Initial value` - an optional default field value that is used to pre-populate the form
de: `Initialwert` - Ein Standardwert mit dem das Formularfeld angelegt wird (optional)

source: `Read-only` - specifies that the value is not editable, used to display previously-entered information
de: `Schreibgeschützt` - Das Feld kann nicht durch den Nutzer geändert werden (optional)

source: `Mandatory` - specifies that a field value is required, so that the form cannot be completed without a value
de: `Pflichtfeld` - Das Feld muss ausgefüllt werden, damit das Formular abgesendet werden kann

source: Text fields also have an additional `Multi-line` option that specifies that the form field be displayed as a multi-line text input area, for longer text values.
de: Textfelder haben zusätzlich die Option `Mehrzeilig` um die Eingabe von längeren Texten zu ermöglichen.

source: Choice fields have a `Options` - the list of values to choose between:
de: In Auswahlfeldern können die verschiedenen Möglichkeiten der Auswahl unter `Optionen` konfiguriert werden.
fr: Le champ `Menu déroulant` a une `Options` - la liste des valeurs à choisir :

source: Choice field configuration
de: Konfiguration eines Auswahlfelds.
fr: Configuration d'un menu déroulant

source: Date fields have a `Date/time` option for choosing between a date and time, just a date without a time of day, or just a time:
de: In Datumsfeldern können Sie sich unter der Option `Datum / Uhrzeit` entscheiden, ob Sie nur ein Datum, eine Datum und eine Uhrzeit oder nur eine Uhrzeit auswählen möchten.
fr: Les champs de date ont une option `Date/Heure` pour choisir entre une date et une heure, juste une date ou une heure ou les 2 :

source: Date field configuration
de: Konfiguration eines Datumsfelds
fr: Configuration du champ date

source: User fields also have a `Candidates` option that you can use to choose which users can be selected:
de: Um in Nutzerfeldern die Auswahl zu erleichtern können Sie unter `Kandidaten` die Liste der zur Auswahl stehenden Personen einschränken. Nutzer haben trotzdem weiterhin die Möglichkeit unter allen Nutzern in der Organisation zu wählen, wenn Sie dies möchten.

source: User field configuration
de: Konfiguration eines Nutzerfelds
fr: Configuration du champ Utilisateur

source: `Allow entering multiple values` - specifies that the field has a list of values that you add and remove independently
de: `Eingabe mehrerer Werte erlauben` - legt fest, dass dieses Feld eine Liste von Werten akzeptiert, die Sie individuell verwalten können
fr: `Permettre la saisie de valeurs multiples` - spécifie que le champ a une liste de valeurs que vous ajoutez et supprimez indépendamment

source: When you enable the `Allow entering multiple values` option, the field is shown differently on forms. Each value you enter is added to the list. Use the × icon to remove a value.
de: Wenn Sie die Option `Eingabe mehrerer Werte erlauben` aktivieren, wird das entsprechende Feld etwas anders in Formularen angezeigt. Jeder Wert, den Sie eingeben wird zu einer Liste hinzugefügt. Um einen Wert zu entfernen, klicken Sie auf das × Symbol.

source: Entering multiple field values in two text fields
de: Eingabe mehrerer Werte in zwei Text-Felder
fr: Saisie de plusieurs valeurs dans deux champs texte

source: In Signavio Workflow, you can use forms to enter information when you run a process. You can use forms in two places: form triggers and user tasks.
fr: Dans Signavio Workflow Accelerator, vous pouvez utiliser des formulaires pour entrer des informations lorsque vous exécutez un workflow. Vous pouvez utiliser des formulaires à deux endroits: les formulaires déclencheurs et les tâches utilisateur.

source: Use the `Description` text area to provide initial instructions to people who complete the form. You can use `Markdown <http://daringfireball.net/projects/markdown/basics>`_ to format the description, which makes it convenient to link to additional information, for example.
fr: Utilisez la zone de texte `Description` pour fournir des instructions initiales aux personnes qui remplissent le formulaire. Vous pouvez utiliser `Markdown <http://daringfireball.net/projects/markdown/basics>`_ pour formater cette description, qui peut être utilisé pour fournir in lien vers des informations supplémentaires.

source: The `Reuse a field` section lists variables that have already been defined on other forms, such as a trigger form:
fr: La section `Réutiliser un champ` répertorie les variables qui ont déjà été définies sur d'autres formulaires, tels qu'une formulaire déclencheur:

source: Adding an existing field to a form makes it possible to view or update existing information, such as a user task form that you use to complete information the person who started the case did not enter on the trigger form.
fr: L'ajout d'un champ existant à un formulaire permet d'afficher ou de mettre à jour les informations existantes, telles qu'un formulaire de tâche utilisateur que vous utilisez pour compléter les informations que la personne qui a démarré le cas n'a pas entré dans le formulaire de déclencheur.

source: The `Fields` section shows the fields you add to a form:
fr: La section `Champs` affiche les champs que vous ajoutez à un formulaire:

source: You can also configure the following properties.
fr: Vous pouvez également configurer les propriétés suivantes.

source: `Initial value` - an optional default value that pre-populates the form field
fr: `valeur initiale` - une valeur par défaut (facultative)

source: `Read-only` - specifies that you cannot edit the value, used to display previously-entered information
fr: `lecture seule` - spécifie que vous ne pouvez pas modifier la valeur, utile pour afficher des informations précédemment saisies

source: `Mandatory` - specifies that you must enter a field value, so that you cannot complete the form without a value for this field
fr: `obligatoire` - spécifie que vous devez entrer une valeur pour ce champ, de sorte que vous ne pouvez pas remplir le formulaire sans saisir une valeur pour ce champ

source: Text fields also have an additional `Multi-line` option that configures Signavio Workflow to display the form field as a multi-line text input area, for longer text values.
fr: Les champs de texte ont également une option `multiligne`. Dans ce cas, Signavio Workflow Accelerator affiche le champ de formulaire en tant que zone de texte multiligne, pour des valeurs de texte plus longues.

source: When you enable the `Allow entering multiple values` option, the field appears differently on forms. Entering a value adds it to the list. Use the × icon to remove a value.
fr: Lorsque vous activez l'option `Permettre la saisie de valeurs multiples`, le champ apparaît différemment sur les formulaires. La saisie d'une valeur l'ajoute à une liste. Utilisez l'icône X pour supprimer une valeur de cette liste.

source: User fields also have a `Candidates` option that you can use to choose which users you can assign:
fr: Les champs `Utilisateur` ont également une option `Participants` que vous pouvez utiliser pour choisir les utilisateurs que vous pouvez assigner:
