Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/introduction.po
Languages: de, fr

source: Introduction
de: Einleitung

source: `Signavio Workflow <http://www.signavio.com/products/workflow/>`_ is a web-based workflow modelling and execution platform. Although its heritage includes classical Business Process Management Systems (BPMS), Signavio Workflow dramatically simplifies workflow automation.
de: `Signavio Workflow <http://www.signavio.com/products/workflow/>`_ ist eine webbasierte Workflowmodellierungs- und Ausführungsplattform. Trotz seiner Verwandschaft nit klassischen Business Process Management Systemen (BPMS), vereinfacht Signavio Workflow die Workflow-Automatisierung stark.
fr: `Signavio Workflow Accelerator <https://www.signavio.com/fr/products/workflow-accelerator/>`_ est une plateforme de modélisation et d'exécution de workflows basée sur le Web. Bien que son héritage comprenne des systèmes classiques de gestion des processus métiers (BPMS), Signavio Workflow Accelerator simplifie considérablement l'automatisation des workflows.

source: How it works
de: So funktioniert's
fr: Comment ça marche

source: A process - strictly a process *model* - defines a template for repetitive work. The people who manage work typically create processes and specify the tasks and actions that you must complete to reach a certain goal. For example: for every :ref:`Hire employee <hire-employee>` case, someone must complete the *Plan interview*, *Interview candidate* and *Send job offer* tasks.
de: Prozesse - oder streng genommen *Prozessmodelle* - sind Vorlagen für wiederkehrende Arbeiten. Typischerweise werden Prozesse von Mitarbeitern angelegt, die koordinieren, welche Aufgaben erledigt werden müssen um ein bestimmtes Ziel zu erreichen. Zum Beispiel müssen im Fall einer Neuanstellung die Aufgaben :ref:`Mitarbeiter einstellen <hire-employee>`, *Vertrag vorbereiten* und *Email Konto anlegen* abgeschlossen werden.
fr: Un processus - plus précisément une *modélisation* de processus - définit le cadre du travail répétitif. Les personnes en charge créent généralement des processus, des tâches et des actions que vous devez accomplir pour atteindre vos objectifs. Par exemple : pour chaque cas :ref:`Embauche d'un employé <hire-employee>`, quelqu'un doit exécuter les tâches *planifier l'entretien*, *Conduire l'entretien avec le candidat* et *Envoyer l'offre d'emploi*.

source: After you publish a process, you can start many individual cases. Signavio Workflow keeps track of which tasks and actions you have to perform for each case. Cases bring people together with relevant information that provides context for completing the tasks. You can also use cases as collaboration spaces for people to discuss and create new tasks for individual cases on the fly.
de: Nachdem ein Prozess veröffentlicht wurde können viele individuelle Fälle gestartet werden. Signavio Workflow überwacht dabei welche Aufgaben und Aktivitäten ausgeführt werden müssen. Mit Fällen können Sie Kollegen zusammenbringen um alle relevanten Informationen, die zur Durchführung benötigt werden, zusammenzutragen. In jedem Fall können alle Themen rund um eine Aufgabe diskutiert und weitere Aufgaben on-the-fly angelegt werden.
fr: Après avoir publié un workflow, vous pouvez démarrer plusieurs cas individuels. Signavio Workflow Accelerator maintient le suivi des tâches et des actions que vous devez effectuer pour chaque cas. Les cas rassemblent les personnes autour d'informations pertinentes qui contextualisent l'accomplissement tâches. Vous pouvez également utiliser les cas comme espaces de collaboration pour discuter et créer, à la volée, de nouvelles tâches dans des cas.

source: When to use Signavio Workflow
de: Wann ist Signavio Workflow zu verwenden
fr: Quand utiliser Signavio Workflow Accelerator

source: You will find Signavio Workflow useful for describing and collaborating on routine work. Use Signavio Workflow for:
de: Signavio Workflow eignet sich ideal um immer wiederkehrenden Arbeiten zu beschreiben und gemeinsam zu erledigen. Nutzen Sie Signavio Workflow um:
fr: Signavio Workflow Accelerator est utile pour la description et la collaboration lors du travail répétitif. Utilisez Signavio Workflow Accelerator pour :

source: coordinating tasks and handovers
de: Aufgaben und Übergaben zu koordinieren
fr: coordonner les tâches et les réassignations

source: approvals
de: Freigaben durchzuführen
fr: valider des tâches

source: routing documents
de: Dokumente zu leiten
fr: transmettre des documents

source: fully-fledged business processes.
de: Komplexe Geschäftsprozesse zu handhaben
fr: modèliser des workflows à usage general.

source: Benefits
de: Vorteile
fr: Avantages

source: You’ll get:
de: Was Sie bekommen:
fr: Vous bénéficiez de :

source: control where you need it
de: Kontrolle an den Stellen, an denen sie gebraucht wird
fr: contrôle efficace

source: flexibility
de: Flexibilität
fr: flexibilité

source: fewer delays (with automatic triggers, actions and timers)
de: Weniger Verzögerungen (durch automatische Auslöser, Aktionen und Timer)
fr: moins de retards (grâce aux déclencheurs automatiques, actions et minuteries)

source: no more miscommunications during handovers
de: Klare Kommunikation von Übergaben
fr: moins de mauvaise communication lors des réassignations

source: traceability - data on who did what
de: Nachverfolgbarkeit - wer hat was getan
fr: traçabilité - suivi de l'activité

source: clarity - visibility of who has to do what
de: Klarheit - wer muss was tun
fr: clarté - visibilité des rôles et responsabilités

source: agility - because you can change Signavio Workflow process models more easily than custom software.
de: Agilität - Prozesse können leichter geändert werden als Software.
fr: agilité - vous pouvez changer les modèles de processus des workflows Signavio plus facilement que dans un logiciel personnalisé.

source: Acknowledgements
de: Danksagungen
fr: Remerciements

source: Signavio uses open source software. We thank everyone involved in the open source community. Please download the :download:`list of open source components that Signavio Workflow uses <download/Open-Source-Components-Signavio-Workflow.pdf>` (PDF).
de: Signavio benutzt Open Source Software. Wir möchten allen in der Open Source Community danken. Bitte folgen Sie :download:`diesem Link <download/Open-Source-Components-Signavio-Workflow.pdf>`, um eine Liste von allen Open Source Komponenten einzusehen, die wir in dieser Anwendung verwenden.
fr: Signavio utilise un logiciel open source. Nous remercions tous ceux qui participent à la communauté open source. Veuillez télécharger la :download:`liste des composants Open source que Signavio Workflow Accelerator utilise <download/Open-Source-Components-Signavio-Workflow.pdf>` (PDF).
