Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/licenses.po
Languages: de

source: License types
de: Lizenztypen

source: To log in to Signavio Workflow Accelerator, your user account must have a user license that has not expired. You can choose between several license types:
de: Um sich bei Signavio Workflow Accelerator einzuloggen, benötigen sie eine gültige Nutzerlizenz, die nicht abgelaufen ist. Sie können zwischen mehreren Lizenztypen wählen:

source: The *Feature Overview* section on the `Workflow Accelerator product page <http://www.signavio.com/products/workflow/>`__ shows the main differences between these versions. These differences affect:
de: Die Sektion *Funktionen im Überblick* der `Signavio Workflow Accelerator Produktseite <http://www.signavio.com/products/workflow/>`__ zeigt die wichtigsten Unterschiede zwischen den verschiedenen Versionen. Diese Unterschiede beeinflussen:

source: the license expiry period - typically one or twelve months
de: die Laufzeit der Lizenz - normalerweise ein- oder zwölf Monate

source: which software features you can use
de: welche Features der Software Sie verwenden können

source: the amount of user file storage
de: die Menge an Speicherplatz pro Nutzer

source: the support level.
de: den Support Level.

source: The :ref:`billing` page in the application shows details of the current license type.
de: Die Seite :ref:`billing` in der Applikation zeigt die Details Ihres Lizenztyps an.

source: The free trial license lets you try the full version of the software for a limited period without purchasing a license. To create a trial license, use the registration page (`Europe server <https://workflow.signavio.com/registration>`__, `US server <https://workflow-us.signavio.com/registration>`__). When the trial expires, Workflow Accelerator will send you an email inviting you to purchase licenses.
de: Mit der kostenlosen Testlizenz können Sie die volle Produktvielfalt von Signavio WorkflowAccelerator für begrenzte Zeit testen ohne eine Lizenz kaufen zu müssen. Verwenden Sie die Registrierungsseite (`Server Europa <https://workflow.signavio.com/registration>`__, `Server USA <https://workflow-us.signavio.com/registration>`__) um eine Testlizenz zu bekommen. Wenn die Testlizenz abgelaufen ist, schickt Ihnen Signavio Workflow Accelerator eine E-Mail, um Sie zum Kauf von Lizenzen einzuladen.

source: A *Enterprise Cloud* license gives you full access to all features with minimum limitations. To purchase *Enterprise Cloud* licenses, contact `sales@signavio.com <mailto:sales@signavio.com?subject=Signavio%20Workflow%20Enterprise%20Cloud>`__.
de: Eine *Enterprise Cloud* Lizenz gibt ihnen vollen Zugang zu allen Funktionen mit minimalen Einschränkungen. Um die *Enterprise Cloud* Lizenz zu erwerben, kontaktieren Sie `sales@signavio.com <mailto:sales@signavio.com?subject=Signavio%20Workflow%20Enterprise%20Cloud>`__.

source: A free *Academic Cloud* license allows university students to use Workflow Accelerator to learn about workflow management. You may only use this license if you have a valid university email address. You may only use this license for educational purposes and not for administrative processes in an educational institution.
de: Eine kostenlose *Academic Cloud* Lizenz ermöglicht Studenten die kostenlose Verwendung von Signavio Workflow Accelerator, um erste Erfahrungen im Prozessmanagement zu sammeln. Sie können diese Lizenz nur dann verwenden, wenn Sie eine gültige Universitätsemailadresse besitzen. Sie dürfen diese Lizenz in einer Bildungseinrichtung nur für akademische und nicht für administrative Zwecke einsetzen.

source: To register for an academic license, first register for the free trial. Then use the *academic version* link at the bottom of the purchasing page (`Europe server <https://workflow.signavio.com/buy>`__, `US server <https://workflow-us.signavio.com/buy>`__) to extend the license period for one year. Alternatively, use the *Student? Click here* link at the bottom of the :ref:`billing` page in the application.
de: Um sich für eine akademische Lizenz zu registrieren, registrieren Sie sich zunächst für eine freie Testlizenz. Klicken Sie dann den Link *Academic Version* ganz unten auf der Lizenzerwerbsseite (`Server Europa <https://workflow.signavio.com/buy>`__, `Server USA <https://workflow-us.signavio.com/buy>`__) um die Testlizenz für ein Jahr zu verlängern. Alternativ können Sie auch den Link *Student? Hier klicken.* unten links auf der :ref:`billing` Seite in der Applikation verwenden.
