Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/notifications.po
Languages: de, fr

source: Notifications
de: Benachrichtigungen

source: Effektif sends a variety of email notifications, to keep process participants up-to-date with cases they work on and to avoid task handover delays, when someone assigns a task.
de: Effektif verschickt eine Vielzahl von Benachrichtigungen damit Prozessbeteiligte nichts in den Fällen, an denen Sie beteiligt sind, verpassen. Außerdem werden so Verzögerungen bei Aufgabenübergaben verhindert.

source: To avoid unnecessary notifications, Effektif waits a short time before sending notifications and omits notifications that have become obsolete.
de: Um das Versenden von unnötig vielen Benachrichtigungen zu vermeiden, wartet Effektif eine kurze Zeit, bevor es Benachrichtigungen sendet und ignoriert Ereignisse, die anschließend nicht mehr aktuell sind.

source: Case due
de: Fall abgelaufen
fr: Date limite du cas

source: This notification indicates that a case has reached its due date.
de: Diese Benachrichtigung wird verschickt, wenn ein Fall sein Ablaufdatum erreicht hat.
fr: Cette notification indique qu’un cas a atteint sa date d’échéance.

source: Effektif sends this notification to the case’s process owner.
de: Effektif versendet diese Benachrichtigung an den Prozessverantwortlichen.

source: Case task due
de: Fallaufgabe abgelaufen
fr: Date limite de la tâche

source: This notification indicates that a case has reached its due date and has open tasks.
de: Diese Benachrichtigung wird verschickt, wenn ein Fall sein Ablaufdatum erreicht hat und noch offene Aufgaben enthält.
fr: Cette notification indique qu'un cas a atteint sa date limite et a des tâches ouvertes.

source: Effektif sends this notification to the assignees of open tasks in the case.
de: Effektif sendet diese Benachrichtigung an alle Personen, denen offene Aufgaben in dem Fall zugewiesen sind.

source: Task created
de: Aufgabe erstellt
fr: Tâche créée

source: This notification indicates that a new task has been created within a case.
de: Diese Benachrichtigung bedeutet, dass eine neue Aufgabe in einem Fall angelegt wurde.
fr: Cette notification indique qu'une nouvelle tâche a été créée dans un cas.

source: Effektif sends this notification to the task’s default assignee, if the task has one. Effektif also sends this notification to each of the task candidates, or every member of each candidate group, if defined.
de: Effektif verschickt diese Benachrichtigung an den Verantwortlichen der Aufgabe und an alle Kandidaten, falls definiert.

source: Effektif does not send this notification if you disable `Receive notifications via email` in :ref:`Preferences`.
de: Effektif sendet diese Benachrichtigung nicht, wenn Sie unter :ref:`Preferences` die Auswahlbox `Benachrichtigungen per E-Mail erhalten` deaktivieren.

source: Task assigned
de: Aufgabe zugewiesen
fr: Tâche assignée

source: This notification indicates that someone has assigned an existing task within a case.
de: Diese Benachrichtigung bedeutet, dass eine bestehende Aufgabe jemanden zugewiesen wurde.
fr: Cette notification indique que quelqu'un a assigné une tâche existante dans un cas.

source: Effektif sends this notification to the task’s new assignee.
de: Effektif versendet diese Benachrichtigung an den neuen Verantwortlichen für die Aufgabe.

source: Mentioned in a comment
de: In einem Kommentar erwähnt
fr: Mentionné dans un commentaire

source: This notification indicates that someone has been mentioned in a comment on a case.
de: Diese Benachrichtigung bedeutet, dass jemand in einem Kommentar erwähnt wurde.
fr: Cette notification indique que quelqu'un a été mentionné dans un commentaire dans un cas.

source: Effektif sends this notification to each user mentioned in the comment.
de: Effektif sendet diese Benachrichtigung an jeden der in einem Kommentar erwähnt wurde.

source: Reminder scheduled
de: Erinnerung fällig
fr: Rappel planifié

source: This notification reminds case participants that a task remains open.
de: Diese Benachrichtigung erinnert Beteiligte, dass eine Aufgabe offen ist.
fr: Cette notification rappelle aux participants qu'une tâche reste ouverte.

source: Effektif sends this notification to the task’s assignee when someone assigns the task, or to all of the task’s candidates if the task does not have an assignee. If the task does not have an assignee or candidates, Effektif sends the notification to the process’ owner.
de: Effektif sendet diese Benachrichtigung an den Verantwortlichen oder alle Kandidaten der Aufgabe. Ist die Aufgabe niemandem zugewiesen, bekommt der Prozess Eigentümer die Benachrichtigung.

source: Task escalated
de: Aufgabe eskaliert
fr: Tâche réassignée

source: This notification indicates that an open task has reached its escalation deadline.
de: Diese Benachrichtigung bedeutet, dass die Zeitspanne bis eine Aufgabe eskaliert wird abgelaufen ist.
fr: Cette notification indique qu'une tâche ouverte a atteint son délai pour réassignation.

source: Effektif sends this notification to the task’s new assignee, as configured in the user task, or every member of each candidate group, if defined.
de: Effektif sendet die Benachrichtigung an die Person, an die die Aufgabe nun eskaliert wurde, oder - falls eine Gruppe hinterlegt wurde - an alle Kandidaten.

source: Effektif always sends this notification, even if recipients have disabled `Receive notifications via email`.
de: Effektif verschickt diese Benachrichtigung **immer**, auch wenn `Benachrichtigungen per Email erhalten` deaktiviert ist.

source: New user registered
de: Neuer Benutzer registriert
fr: Nouvel utilisateur enregistré

source: Effektif sends a registration notification when someone registers an Effektif trial account.
de: Effektif verschickt eine Registrierungsbenachrichtigung wenn ein Nutzer einen Testaccount registriert.

source: Effektif sends this notification to the email address entered on the registration form.
de: Effektif verschickt diese Benachrichtigung zu der Emailadresse, die im Registrierungsformular eingegeben wurde.

source: Invited to join organisation
de: Einladung verschickt
fr: Invité à rejoindre l’organisation

source: This notification indicates that an organisation administrator has invited someone to join an organisation. Effektif also sends a reminder for this notification when an administrator selects the option to resend the invitation.
de: Diese Benachrichtigung informiert darüber, dass ein Organisationsadministrator jemanden in die Organisation eingeladen hat. Effektif versendet zudem eine Erinnerung, falls ein Administrator die Einladung erneut sendet.

source: Effektif sends this notification to the person the administrator invited, who may or may not already have an Effektif account.
de: Effektif verschickt die Benachrichtigung an die Person, die vom Administrator eingeladen wurde. Unter Umständen hat diese Person bereits einen Effektif-Account.

source: Invitation cancelled
de: Einladung zurückgezogen
fr: Invitation annulée

source: This notification informs someone that an organisation administrator has cancelled an open invitation to join an organisation.
de: Diese Benachrichtigung informiert darüber, dass ein Administrator die Einladung in die Organisation zurückgezogen hat.
fr: Cette notification informe une personne qu'un administrateur de l'organisation a annulé une invitation à adhérer à une organisation.

source: Effektif sends this notification to the person the administrator invited.
de: Effektif verschickt diese Nachricht an die Person, die vorher vom Administrator eingeladen wurde.

source: Password reset
de: Passwort zurückgesetzt
fr: Réinitialiser le mot de passe

source: Effektif sends a password reset notification when someone uses the `Reset your password` option.
de: Effektif informiert den Nutzer, dass jemand die `Passwort zurücksetzen`-Funktion verwendet hat.

source: Effektif sends this notification to the email address entered on the password reset form.
de: Effektif schickt diese Benachrichtigung an die Emailadresse, die im `Passwort zurücksetzen`-Formular eingegeben wurde.

source: Service account access expired
de: Zugriff auf ein Service-Konto ist abgelaufen
fr: Compte de service expiré

source: This notification indicates that access to an external service, such as :ref:`Google Drive <google-drive>`, has expired.
de: Diese Benachrichtigung bedeutet, dass der Zugriff auf ein externes Konto, wie zum Beispiel :ref:`Google Drive <google-drive>` abgelaufen ist.
fr: Cette notification indique que l'accès à un service externe, tel que :ref:`Google Drive <google-drive>` a expiré.

source: Effektif sends this notification to the Effektif user who configured their external service account.
de: Effektif sendet diese Benachrichtigung an den Nutzer, der das Konto in Effektif hinterlegt hat.

source: License about to expire
de: Lizenz läuft bald ab
fr: Licence sur le point d'expirer

source: This notification indicates that an Effektif license will soon expire.
de: Diese Benachrichtigung bedeutet, dass eine Effektif Lizenz bald ablaufen wird.

source: Effektif sends this notification to the administrators of the the Effektif organisation whose license will expire.
de: Effektif sendet diese Benachrichtigung an die Administratoren der Organisation zu der die ablaufenden Lizenzen gehören.

source: Invitation resent
de: Einladung erneut verschickt
fr: Invitation renvoyée

source: This notification reminds someone that organisation administrator has invited them to join an organisation. Effektif support staff trigger this notification manually.
de: Diese Benachrichtigung erinnert jemanden, dass der Administrator der Organisation ihn eingeladen hat, der Organisation beizutreten. Die Effektif Supportmitarbeiter lösen diese Benachrichtigung manuell aus.

source: Notifications reference
fr: Référence des notifications

source: Signavio Workflow sends a variety of email notifications, to keep process participants up-to-date with cases they work on and to avoid task handover delays, when someone assigns a task.
fr: Signavio Workflow Accelerator envoie une variété de notifications par e-mail, pour garder les participants au workflow à jour concernant les cas sur lesquels ils travaillent, pour éviter les retards ou lorsque quelqu'un assigne une tâche.

source: To avoid unnecessary notifications, Signavio Workflow waits a short time before sending notifications and omits notifications that have become obsolete.
fr: Pour éviter les notifications inutiles, Signavio Workflow Accelerator crée un délai avant d'envoyer des notifications et omet les notifications devenues obsolètes.

source: Signavio Workflow sends this notification to the case’s process owner.
fr: Signavio Workflow Accelerator envoie cette notification au propriétaire du cas du workflow.

source: Signavio Workflow sends this notification to the assignees of open tasks in the case.
fr: Signavio Workflow Accelerator envoie cette notification aux responsables des tâches ouvertes dans le cas.

source: Signavio Workflow sends this notification to the task’s default assignee, if the task has one. Signavio Workflow also sends this notification to each of the task candidates, or every member of each candidate group, if defined.
fr: Signavio Workflow Accelerator envoie cette notification au reponsable par défaut de la tâche, si la tâche en possède un. Signavio Workflow Accelerator envoie également cette notification à chacun des candidats de la tâche, ou chaque membre de chaque groupe de candidats, si défini.

source: Signavio Workflow does not send this notification if you disable `Receive notifications via email` in :ref:`Preferences`.
fr: Signavio Workflow Accelerator n'envoie pas cette notification si vous désactivez `Recevoir des notifications par e-mail` dans :ref:`Preferences`.

source: Signavio Workflow sends this notification to the task’s new assignee.
fr: Signavio Workflow Accelerator envoie cette notification au nouveau responsable de la tâche.

source: Signavio Workflow sends this notification to each user mentioned in the comment.
fr: Signavio Workflow Accelerator envoie cette notification à chaque utilisateur mentionné dans le commentaire.

source: Signavio Workflow sends this notification to the task’s assignee when someone assigns the task, or to all of the task’s candidates if the task does not have an assignee. If the task does not have an assignee or candidates, Signavio Workflow sends the notification to the process’ owner.
fr: Signavio Workflow Accelerator envoie cette notification au responsable de la tâche lorsque quelqu'un l'assigne ou à tous les candidats de la tâche si la tâche n'a pas de reponsable. Si elle n'a pas de responsable ou de candidat, Signavio Workflow Accelerator envoie la notification au propriétaire du workflow.

source: Signavio Workflow sends this notification to the task’s new assignee, as configured in the user task, or every member of each candidate group, if defined.
fr: Signavio Workflow Accelerator envoie cette notification au nouveau responsable de la tâche, tel qu'il est configuré dans la tâche utilisateur, ou chaque membre de chaque groupe candidat, si défini.

source: Signavio Workflow always sends this notification, even if recipients have disabled `Receive notifications via email`.
fr: Signavio Workflow Accelerator envoie toujours cette notification, même si les destinataires ont désactivé `Recevoir des notifications par e-mail`.

source: Signavio Workflow sends a registration notification when someone registers a Signavio Workflow trial account.
fr: Signavio Workflow Accelerator envoie une notification lorsque quelqu'un s'inscrit à un compte d'essai Signavio Workflow Accelerator.

source: Signavio Workflow sends this notification to the email address entered on the registration form.
fr: Signavio Workflow Accelerator envoie cette notification à l'adresse e-mail inscrite sur le formulaire d'inscription.

source: This notification indicates that an organisation administrator has invited someone to join an organisation. Signavio Workflow also sends a reminder for this notification when an administrator selects the option to resend the invitation.
fr: Cette notification indique qu'un administrateur de l'organisation a invité quelqu'un à rejoindre à une organisation. Signavio Workflow Accelerator envoie également un rappel pour cette notification lorsqu'un administrateur sélectionne l'option pour renvoyer l'invitation.

source: Signavio Workflow sends this notification to the person the administrator invited, who may or may not already have a Signavio Workflow account.
fr: Signavio Workflow Accelerator envoie cette notification à la personne invitée par l'administrateur.

source: Signavio Workflow sends this notification to the person the administrator invited.
fr: Signavio Workflow Accelerator envoie cette notification à la personne invitée par l'administrateur.

source: This notification reminds someone that organisation administrator has invited them to join an organisation. Signavio Workflow support staff trigger this notification manually.
fr: Cette notification rappelle à quelqu'un que l'administrateur de l'organisation l'a invité à rejoindre à une organisation.

source: Signavio Workflow sends a password reset notification when someone uses the `Reset your password` option.
fr: Signavio Workflow Accelerator envoie une notification de réinitialisation de mot de passe lorsque quelqu'un utilise l'option `Réinitialiser votre mot de passe`.

source: Signavio Workflow sends this notification to the email address entered on the password reset form.
fr: Signavio Workflow Accelerator envoie cette notification à l'adresse e-mail indiquée dans le formulaire de réinitialisation du mot de passe.

source: Signavio Workflow sends this notification to the Signavio Workflow user who configured their external service account.
fr: Signavio Workflow Accelerator envoie cette notification à l'utilisateur qui a configuré son compte de service externe.

source: This notification indicates that a Signavio Workflow license will soon expire.
fr: Cette notification indique qu'une licence de Signavio Workflow Accelerator va bientôt expirer.

source: Signavio Workflow sends this notification to the administrators of the the Signavio Workflow organisation whose license will expire.
fr: Signavio Workflow Accelerator envoie cette notification aux administrateurs de l'organisation Signavio Workflow Accelerator dont la licence va expirer.
