Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/process-builder.po
Languages: fr

source: Process builder
fr: Générateur de Workflow

source: A process defines a template for automating repetitive work, like a recipe that describes the actions that you perform to achieve a goal. For example, consider a :ref:`Hire employee <hire-employee>` process. Each time an organization hires someone, the recruitment team has to complete a number of tasks, including ‘Evaluate CV’, ‘Plan interview’ and ‘Interview candidate’. Each time someone starts the process, Signavio Workflow creates a new case.
fr: Un workflow définit un modèle pour automatiser un travail répétitif, comme une recette qui décrit les actions que vous devez effectuer pour atteindre un objectif. Par exemple, considérez un workflow :ref:`Embaucher un employé <hire-employee>`. Chaque fois qu'une organisation embauche quelqu'un, l'équipe de recrutement doit compléter un certain nombre de tâches, y compris «évaluer CV», « Plannifier l'interview» et «Procéder à l'entretien». Chaque fois que quelqu'un démarre le workflow, Signavio Workflow crée un nouveau cas.

source: Use the process builder to create and configure executable processes. You can think of an executable process as a kind of software, but you will find it easier to build automation using processes. With Signavio Workflow, non-technical people can create useful processes.
fr: Utilisez le générateur de workflow pour créer et configurer des processus exécutables. Vous pouvez penser à un processus exécutable comme une sorte de logiciel, mais vous trouverez plus facile de construire l'automatisation à l'aide des workflows. Avec Signavio Workflow Accelerator, les personnes non techniques peuvent créer des Workflows utiles.

source: Creating a process
fr: Création d'un Workflow

source: To create a process, select *Processes* in the main menu, then the *Create new process* button. In the text input field, enter a process name.
fr: Pour créer un Workflow, sélectionnez *Workflow* dans le menu principal, puis le bouton *Créer un nouveau Workflow*. Dans le champ d'entrée de texte, saisissez un nom de Workflow.

source: Choosing a good process name
fr: Choisir un bon nom de Workflow

source: Use the following guidelines to choose a good process name, to make the list of processes easier to read and talk about.
fr: Utilisez les lignes directrices suivantes pour choisir un bon nom de Workflow, pour rendre la liste des processus plus facile à lire et à discuter.

source: Describe the process goal.
fr: Décrire le but du Workflow.

source: Use an imperative verb phrase that completes a sentence like *For your next job, you have to…*
fr: Utilisez une phrase avec un verbe à l'impérative qui termine une phrase comme *Pour votre prochaine tâche, vous devez ...*

source: Use more than one word, to get a descriptive name.
fr: Utilisez plus d'un mot pour obtenir un nom descriptif.

source: Avoid using more than three or four words.
fr: Évitez d'utiliser plus de trois ou quatre mots.

source: Avoid vague words like ‘manage’, ‘do’, ‘process’ or ‘handle’.
fr: Évitez les mots vagues comme « gérer », « faire », « processus » ou « gérer ».

source: *Hire employee*, for example, summarises a process better than *Recruitment*.
fr: *Embaucher un employé*, par exemple, résume mieux un processus que *Recrutement*.

source: Next steps for a new process
fr: Prochaines étapes pour un nouveau Workflow

source: Once you have created a process, continue to build the process model using the following process builder sections.
fr: Une fois que vous avez créé un Workflow, continuez à générer le modèle de Workflow à l'aide des sections suivantes du générateur de Workflow.

source: :ref:`triggers` determine how you start new cases for the process
fr: :ref:`triggers` détermine comment vous démarrez de nouveaux cas pour le Workflow

source: :ref:`actions` define the flow for tasks and other steps in the process
fr: :ref:`actions` définissent le flux de tâches et des autres étapes dans le Workflow

source: :ref:`details` include process metadata and access control.
fr: :ref:`details` incluent les métadonnées de Workflow et le contrôle d'accès.

source: Triggers
fr: Déclencheurs

source: A trigger in a process specifies how the process starts. Triggers do not have any relation to :ref:`start events <start-event>`.
fr: Un déclencheur dans un Workflow spécifie comment le processus démarre. Les déclencheurs n'ont aucune relation avec les :ref:`événements de début <start-event>`.

source: Manual trigger
fr: Déclencheur manuel

source: A manual trigger gives you the simplest way to start a process. With a manual trigger, you start processes manually in Signavio Workflow, by selecting `Start new case` and then selecting the process to start.
fr: Un déclencheur manuel vous donne le moyen le plus simple de démarrer un Workflow. Avec un déclencheur manuel, vous démarrez les processus manuellement dans Signavio workflow, en sélectionnant 'Démarrer un nouveau cas', puis en sélectionnant le Workflow à démarrer.

source: Form trigger
fr: Déclencheur par formulaire

source: With a form trigger, you use a form to start a process. After selecting the form trigger, you can use the form builder to specify form fields.
fr: Avec un déclencheur par formulaire, vous utilisez un formulaire pour démarrer un Workflow. Après avoir sélectionné le déclencheur par formulaire, vous pouvez utiliser le générateur de formulaires pour spécifier les champs du formulaire.

source: Form trigger configuration - using the form builder to define a trigger form
fr: Configuration du déclencheur par formulaire - Utilisation du générateur de formulaires pour définir le déclencheur par formulaire

source: Email trigger
fr: Déclencheur par email

source: An email trigger starts a new case for each email that you send to the trigger’s Signavio Workflow email address. Note this differs from reading an existing email account, such as your own. After selecting the email trigger, you can see its email address:
fr: Un déclencheur par email démarre un nouveau cas pour chaque email que vous envoyez à l'adresse e-mail du déclencheur de Signavio Workflow Accelerator. Notez que ceci diffère de la lecture d'un compte de messagerie. Après avoir sélectionné le déclencheur par email, vous pouvez voir son adresse e-mail :

source: Mail trigger configuration
fr: Configuration du déclencheur par email

source: The email trigger creates a :ref:`trigger-email-variable`.
fr: Le déclencheur par email crée une :ref:`trigger-email-variable`.

source: You can use an email trigger by adding the trigger email address to a mailing list, such as `support@example.com `or `info@example.com`. You’ll have to ask the administrator of the mailing list to add the process trigger’s email address to the list. Once you have done this, the process trigger address will also receive any email sent to the mailing list, starting the process in Signavio Workflow. You will then see the email in the event stream:
fr: Vous pouvez utiliser un déclencheur par email en ajoutant l'adresse e-mail de déclenchement à une liste de diffusion, telle que «support@example.com» ou «info@example.com». Vous devrez demander à l'administrateur de la liste d'envoi d'ajouter l'adresse e-mail du déclencheur de Workflow à la liste. Une fois que vous avez fait cela, l'adresse de déclenchement de Workflow recevra également tous les e-mails envoyés à la liste de diffusion, en démarrant les cas dans Signavio Workflow. Vous verrez ensuite l'e-mail dans le flux d'événements:

source: Trigger mail in stream
fr: Le déclencheur par email dans le flux d'événements

source: Salesforce trigger
fr: Déclencheur Salesforce

source: A Salesforce trigger starts a new case in response to Salesforce sending an outbound message as part of a Salesforce workflow. Before you can use a Salesforce trigger, configure :ref:`Salesforce Integration <salesforce-integration>`.
fr: Un déclencheur Salesforce démarre un nouveau cas en réponse à Salesforce envoyant un message sortant dans le cadre d'un workflow Salesforce. Avant de pouvoir utiliser un déclencheur Salesforce, configurez ref:`l'intégration Salesforce <salesforce-integration>`.

source: When you have configured a Salesforce service, you can select it as a process trigger, so that messages from Salesforce will now trigger new cases.
fr: Lorsque vous avez configuré un service Salesforce, vous pouvez le sélectionner comme déclencheur de Workflow, de sorte que les messages de Salesforce déclenchent maintenant de nouveaux cas.

source: Example of a Salesforce trigger
fr: Exemple de déclencheur Salesforce

source: In the process definition, you can use the Salesforce object fields from the Salesforce message just like normal :ref:`variables <variables>`.
fr: Dans la définition du Workflow, vous pouvez utiliser les champs d'objet Salesforce du message Salesforce juste comme les :ref:`variables <variables>` normale.

source: Actions represent the steps in a process - things to do. Action include things like user tasks in Signavio Workflow, operations on a file in a document management system or any other actions that represent work that someone will perform as part of a process. When starting a process, Signavio Workflow will ‘execute’ the actions in a process in the proper order. The process :ref:`control flow <control-flow>` determines this ordering, using transitions, gateways and events.
fr: Les actions représentent les étapes dans un Workflow - les choses à faire. Les actions comprennent des choses comme des tâches utilisateur dans Signavio Workflow Accelerator, les opérations sur un fichier dans un système de gestion de document ou toute autre action qui représente le travail que quelqu'un 'exécutera' dans le cadre d'un Workflow. Lors du démarrage d'un Workflow, Signavio Workflow Accelerator va «exécuter» les actions d'un Workflow dans l'ordre approprié. Le :ref:`flux de contrôle <control-flow>` du Workflow détermine cet ordre, en utilisant des transitions, des passerelles et des événements.

source: A process can include different :ref:`action-types`. A user task will create a task in a case. A ‘Send Email’ action will send an email. A ‘Google file upload’ action will upload a file to a Google Drive folder.
fr: Un processus peut inclure différents types d'actions. Une tâche utilisateur créera une tâche dans un cas. Une action "Envoyer un email" enverra un email. Une action "Télécharger un fichier Google" va télécharger un fichier dans un dossier Google Drive.

source: The *Process builder*’s actions palette
fr: La palette d'actions du *générateur de Workflow*

source: The `BPMN <http://en.wikipedia.org/wiki/Business_Process_Model_and_Notation>`_ diagram editor shows actions and control flow elements, such as events and gateways. Use the diagram editor to add sequential flows between actions, decisions and other control flow behaviour.
fr: L'éditeur de diagrammes `BPMN <https://fr.wikipedia.org/wiki/Business_process_model_and_notation>`_ affiche les actions et les éléments de flux de contrôle, tels que les événements et les branchements. Utilisez l'éditeur de diagrammes pour ajouter des flux de séquences entre les actions, les décisions et d'autres types de flux de contrôle.

source: Adding a transition
fr: Ajout d'une transition

source: You can create a transition in the `Advanced flows` view. A transition specifies sequential flow, which means the next action only starts when someone has completed the previous one.
fr: Vous pouvez créer une transition dans la vue `flux avancé`. Une transition spécifie le flux de séquences, ce qui signifie que l'action suivante ne démarre que lorsqu'une personne a terminé la précédente.

source: To add a transition, click to select the first action. Several symbols appear to the right of the selected element:
fr: Pour ajouter une transition, cliquez pour sélectionner la première action. Plusieurs symboles apparaissent à droite de l'élément sélectionné :

source: Start creating a transition by dragging the transition symbol to the destination
fr: Commencez à créer une transition en faisant glisser le symbole de transition vers la destination

source: Click the transition symbol |transition-symbol| and drag it to the destination element. When you drag the symbol over the destination element, it indicates that you can drop to create the transition:
fr: Cliquez sur le symbole de la transition |transition-symbol| et faites-la glisser vers l’élément de destination. Lorsque vous faites glisser le symbole sur l’élément de destination, il indique si vous pouvez le connecter pour créer la transition :

source: Creating a transition hovering over destination
fr: Création d’une transition en plaçant le curseur sur la destination

source: Release the mouse button over the destination to create the transition.
fr: Relâchez le bouton de la souris sur la destination pour créer la transition.

source: Creating the next user task
fr: Création de la prochaine tâche utilisateur

source: You can easily create the next User Task in a process in the same way you created transitions, above. Start by selecting the previous action:
fr: Vous pouvez facilement créer la prochaine tâche utilisateur dans un Workflow de la même manière que vous avez créé les transitions précédentes. Commencez par sélectionner l’action précédente :

source: Start creating the next user task by dragging the action symbol
fr: Commencez à créer la prochaine tâche de l’utilisateur en faisant glisser le symbole de l’action

source: Click the rounded rectangle symbol |task-symbol| and drag it to an empty place on the canvas.
fr: Cliquez sur le symbole rectangle arrondi |task-symbol| et faites-le glisser vers un endroit vide sur la toile.

source: Drag the rounded rectangle symbol to an empty place
fr: Faites glisser le symbole rectangle arrondi vers un endroit vide

source: Drop the symbol where you want to create the next user task. Release the mouse button to create new user task where you dropped it, with a transition from the previous action.
fr: Déplacez le symbole où vous souhaitez créer la tâche suivante de l'utilisateur. Relâchez le bouton de la souris pour créer une nouvelle tâche utilisateur à cette endroit incluant une transition depuis l'action précédente.

source: Adding the next user task and its transition at the same time
fr: Ajout de la tâche utilisateur suivante avec sa transition

source: Alternatively, just click the user task icon |task-symbol| to create a new user task in the default location, with a transition.
fr: Sinon, il suffit de cliquer sur l'icône tâche utilisateur |task-symbol| pour créer une nouvelle tâche utilisateur dans l'emplacement par défaut, avec sa transition.

source: Changing the action type
fr: Modification du type d'action

source: Sometimes, modifying a process means changing an action from one type to another. In the recruitment process, you might change the action to reject the candidate from a manual task to an automatic email task.
fr: Parfois, la modification d'un Workflow implique la modification d'une action d'un type à un autre. Dans le workflow de recrutement, vous pouvez modifier l'action de rejeter un candidat en tant que tâche manuelle à une tâche d'email automatique.

source: To make this change, first select the action in the process editor to open the configuration panel, then click the action type icon at the top-left corner of the configuration panel to open the list of action types. Next, select *Send Email* from the list to change the action type.
fr: Pour effectuer cette modification, sélectionnez d'abord l'action dans l'éditeur de Workflow pour ouvrir le panneau configuration, puis cliquez sur l'icône de type d'action dans le coin supérieur gauche du panneau de configuration pour ouvrir la liste des types d'action. Ensuite, sélectionnez *Envoyer un email* dans la liste pour modifier le type d'action.

source: Changing a :ref:`user-task` to a :ref:`send-email` task.
fr: Modification d'une :ref:`user-task` en une tâche :ref:`send-email`.

source: Changing the action type discards the previous action type’s configuration, such as a user task form or an email template. If you change the action type back, the original configuration will not be restored.
fr: La modification du type d'action annule la configuration de l'action précédente, telle qu'un formulaire ou un modèle d'email. Même si vous choisissez de nouveau la même ancienne action, la configuration d'origine ne sera pas restaurée.

source: Control flow elements
fr: Éléments de flux de contrôle

source: The diagram also includes control flow elements, such as events and gateways. Unlike actions, control flow elements don’t represent something that should happen. Instead, you use events and gateways to specify the flow between the actions.
fr: Le diagramme inclut également des éléments de flux de contrôle, tels que des événements et des branchements. Contrairement aux actions, les éléments de flux de contrôle ne représentent pas quelque chose qui devrait se produire. Au lieu de cela, vous utilisez des événements et des branchements pour spécifier le flux entre les actions.

source: Details
fr: Détails

source: In the process builder, select the *Details* tab to further configure the process.
fr: Dans le générateur de Workflow, sélectionnez l'onglet *Détails* pour configurer plus de détails sur le Workflow.

source: Configuring process details
fr: Configuration des détails du Workflow

source: On the *General* tab, configure the following process properties.
fr: Sous l'onglet *Général*, vous pouvez configurer les paramètres suivant.

source: *Process owner* - shown on the *Processes* page to indicate who has responsibility for a process model, and used as the default recipient of some :ref:`notifications <notifications>`.
fr: *Propriétaire du Workflow* - affiché sur la page * Workflow* pour indiquer qui a la responsabilité d'un modèle de Workflow, et utilisé comme destinataire par défaut de certaines :ref:`notifications <notifications>`.

source: *Process description* - documents a process, usually by describing the process goal.
fr: *Description du Workflow* - documente un Workflow, généralement en décrivant l'objectif du Workflow.

source: *Case name template* - the name for new cases of this process, usually containing trigger :ref:`variables <variables>` so that each case has a different name.
fr: *Modèle de nom des cas* - le nom pour les nouveaux cas de ce Workflow, contenant généralement des :ref:`variables <variables>` de déclenchement de sorte que chaque cas a un nom différent.

source: Use the *Access control* tab to restrict access to this process and its cases.
fr: Utilisez l'onglet *Droits d'accès* pour restreindre l'accès à ce Workflow et à ses cas.

source: Use the *Field overview* tab to view and rename this process’ :ref:`variables <variables>`.
fr: Utilisez l'onglet *Aperçu des champs* pour afficher et renommer les :ref:`variables <variables>` de ce processus.

source: When you use the process editor to edit your process model, Signavio Workflow saves all of your changes immediately. You can go back and edit the process again later, and it will not have changed. However, to execute a process by starting a new case you need a published version.
fr: Lorsque vous utilisez l'éditeur de Workflow pour modifier votre modèle, Signavio Workflow Accelerator enregistre tous vos changements en temps réel. Vous pouvez revenir plus tard et modifier à nouveau le Workflow, et il n'aura pas changé. Cependant, pour exécuter un nouveau cas en utilisant ce nouveau Workflow, vous avez besoin de publier cette nouvelle version.

source: Publishing a process version
fr: Publication d'une version du Workflow

source: The process editor’s `Versions` tab shows a list of published versions. Until you publish the first version, this page shows a message that there the process has ‘no published versions’.
fr: L'onglet `Versions` de l'éditeur de Workflow affiche une liste des versions publiées. Jusqu'à ce que vous publiiez la première version, cette page affiche un message indiquant qu'il n'y a pas de «version publiée».

source: The process editor’s `Versions` tab with no published versions
fr: L'onglet `Versions` de l'éditeur de Workflow sans versions publiées

source: You can only start a new case for a process that has a published version, hence the light green button displays ‘Publish to run this process’. After you publish the first version, the list shows version #1 and you can start a new case using that version.
fr: Vous ne pouvez démarrer un nouveau cas pour un Workflow qui a une version publiée, d'où le bouton en vert clair "Publier ce Workflow pour démarrer des cas". Après avoir publié la première version, la liste affiche la version # 1 et vous pouvez démarrer de nouveau cas en utilisant cette version.

source: The `Versions` list after publishing the first version
fr: La liste des `Versions` après la publication de la première version

source: Version #1 always has the description `Initial version`. For later versions, you can add your own description.
fr: La version # 1 a toujours la description `Version initiale`. Pour les versions ultérieures, vous pouvez ajouter votre propre description.

source: Adding version comments
fr: Ajout de commentaires de version

source: After the first published version, you can add a comment to describe the changes when you publish a new version of a process.
fr: Après la première version publiée, vous pouvez ajouter un commentaire pour décrire les modifications apportées lors de la publication de la nouvelle version.

source: The `Publish changes` prompt, where you can add an optional version comment
fr: La fenêtre `Publier les modifications` où vous pouvez éventuellement ajouter un commentaire de version

source: You can omit the version comment, but it helps collaboration between team members by making process modelling more transparent.
fr: Vous pouvez omettre le commentaire de version, mais il aide à la collaboration entre les membres de l'équipe en rendant le processus de modélisation plus transparent.

source: Published versions with descriptive version comments
fr: Versions publiées avec des commentaires de version

source: In this example, each version has a short comment that describes the changes.
fr: Dans cet exemple, chaque version a un commentaire court qui décrit les modifications.

source: Writing good version comments
fr: Rédaction des commentaires utiles

source: When you write version comments, use the following tips to make them more consistent and useful.
fr: Lorsque vous écrivez des commentaires de version, utilisez les conseils suivants pour les rendre plus cohérents et plus utiles.

source: Make the comment an imperative phrase that starts with a word like ‘Add’ or ‘Fix’.
fr: Faire le commentaire avec une phrase impérative qui commence par un mot comme « Ajout » ou « Corrige ».

source: Capitalise the first word and don’t include a full-stop at the end, for consistency.
fr: Utilisez des majuscules pour le premier mot et n'incluez pas de point à la fin, pour la cohérence.

source: Describe specifics, instead of vaguely referring to ‘changes’.
fr: Décrire les spécificités, au lieu de se référer vaguement aux "changements".

source: Keep it short; 3-10 words usually suffice.
fr: Soyez bref ; 3-10 mots suffisent habituellement.

source: Consider making the comment longer to explain why you made this change.
fr: Pensez à faire un commentaire plus long pour expliquer pourquoi vous avez fait ce changement.
