Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/process-builder.po
Languages: fr

source: You may find it easier to publish a series of small changes, creating a number of intermediate versions instead of one big change. Fine-grained versions make the version history more useful.
fr: Vous pouvez trouver plus facile de publier une série de petits changements, en créant un certain nombre de versions intermédiaires au lieu d'une seule importante. Les versions intermédiaires rendent l'historique plus utile.

source: *Variables* contain the workflow data that the process defines. You can use variables in a case name template and when configuring the output of some action types. For example, you can use variables to repeat workflow data on a :ref:`user task form <user-task-form>`, or include a variable value in an :ref:`email task <send-email>` subject line or body text.
fr: Les *variables* contiennent les données de workflow que le processus définit. Vous pouvez utiliser des variables dans un modèle de nom des cas et lors de la configuration de la sortie de certains types d'actions. Par exemple, vous pouvez utiliser des variables pour répéter des données du Workflow sur un :ref:`formulaire de tâche utilisateur <user-task-form>`, ou inclure une valeur d'une variable dans une ligne d'objet ou un corps de texte dans une tâche :ref:`envoyer un email <send-email>`.

source: These variables contain all of the information from forms as well as information required by the process actions. Each case stores its own values for each workflow variable.
fr: Ces variables contiennent toutes les informations des formulaires ainsi que les informations requises par les actions du Workflow. Chaque cas stocke ses propres valeurs pour chaque variable de Workflow.

source: You will usually add a variable to your workflow by adding a :ref:`form field <form-fields>`. You can also create variables in a :ref:`javascript-action`, to capture data that the script retrieves or calculates.
fr: Vous allez généralement ajouter une variable à votre workflow en ajoutant un :ref:`champ de formulaire <form-fields>`. Vous pouvez également créer des variables dans une :ref:`javascript-action`, pour capturer des données que le script récupère ou calcule.

source: A trigger form that populates *Name* and *Date of birth* variables for use in a workflow
fr: Un formulaire de déclenchement qui remplit le *Nom* et la *Date de naissance* comme variables à utiliser dans un Workflow

source: In addition to your own workflow variables, Signavio Workflow automatically creates variables that give you access to additional data in each case. The :ref:`case-variable` contains data from when Signavio Workflow creates the case. An :ref:`email-trigger` adds an :ref:`Email variable <trigger-email-variable>` that contains the trigger email.
fr: En plus de vos propres variables de workflow, Signavio Workflow Accelerator crée automatiquement des variables qui vous donnent accès à des données supplémentaires dans chaque cas. La :ref:`case-variable` contient des données à partir du moment où Signavio Workflow Accelerator crée un cas. Un :ref:`email-trigger` ajoute une :ref:`variable email <trigger-email-variable>` qui contient l'email déclencheur.

source: Variables can have different :ref:`data-types` that determine which kind of data the variable stores, such as text or a date, and whether the data is a single value or contains multiple fields.
fr: Les variables peuvent avoir différents :ref:`data-types` qui déterminent quel type de données la variable stocke, comme du texte ou une date, et si la données est une valeur unique ou contient plusieurs champs.

source: Roles
fr: Rôles

source: Creating a role gives a process-specific name to whoever performs one or more process tasks. You can optionally configure a role with a list of candidates. Roles have the same function as swimlanes in BPMN.
fr: La création d'un rôle donne un nom spécifique dans le workflow à celui qui effectue une ou plusieurs tâches du workflow. Vous pouvez éventuellement configurer un rôle avec une liste de candidats. Les rôles ont la même fonction que couloirs en BPMN.

source: Process roles differ from organizational roles. A process role only lasts for the duration of a case, while organizational roles last longer and relate to the job you perform at the organization. For example, when you have a meeting, one person sometimes takes the role of chairperson. That person doesn’t have the job title *Meeting chair* - they’ve just adopted that role for the duration of the meeting.
fr: Les rôles de workflow diffèrent des rôles organisationnels. Un rôle de workflow ne dure que pour la durée d'un cas, tandis que les rôles organisationnels durent plus longtemps et se rapportent au travail que vous effectuez dans l'organisation. Par exemple, lorsque vous avez une réunion, une personne assume parfois le rôle de *president* mais cette personne n'a pas un poste *Président de séance* - c'est un rôle pour la durée de la réunion.

source: A process in Signavio Workflow can define roles, in the same way that a business meeting ‘process’ has roles for whoever chairs the meeting (the ‘Chair’) and whoever takes minutes (the ‘Secretary’). The following meeting process model assigns the tasks on the top row to the *Chair* and the tasks on the bottom row to the *Secretary*.
fr: Un workflow dans Signavio Workflow peut définir des rôles, de la même manière qu'une réunion a des rôles pour quiconque préside la réunion (le «président») et celui qui prend des notes (le «Secrétaire»). Le modèle de workflow de réunion suivant assigne les tâches de la ligne supérieure au *Président* et les tâches de la ligne du bas au *Secrétaire*.

source: A *Meeting* process, with tasks for *Chair* (top row) and *Secretary* (bottom row) roles
fr: Un workflow de *réunion*, avec des tâches pour le *Président* (ligne du haut) et le *Secrétaire* (ligne du bas)

source: In each meeting (each :ref:`case <cases>` in Signavio Workflow), one person takes the role of chair, and one the role of secretary. These assignments generally don’t change during a meeting. Similarly, Signavio Workflow role assignments don’t change during a case. Signavio Workflow automatically assigns each new task with a role assignment to the person who already has the role.
fr: À chaque réunion (chaque :ref:`cas <cases>` dans Signavio Workflow), une personne prend le rôle de président et l’autre le rôle de Secrétaire. Généralement ces affectations ne changent pas au cours d’une réunion. De même, les attributions de rôles Signavio Workflow ne changent pas au cours d’un cas. Signavio Workflow assigne automatiquement chaque nouvelle tâche avec l'attribution à la personne qui a déjà le rôle.

source: In Signavio Workflow, a process role works like a workflow variable that you use to assigning tasks. A role variable has the :ref:`type-user` type and stores a single user.
fr: Dans Signavio workflow, un rôle de workflow fonctionne comme une variable de workflow que vous utilisez pour assigner des tâches. Une variable rôle a le type :ref:`type-user` et stocke un seul utilisateur.

source: These process roles differ from organization roles. For example, you can have the *Team lead* role in your organization, an assignment that does not necessarily have an end date. A process role, such as *Meeting chair*, has a different scope and only applies for the duration of a single case.
fr: Ces rôles de workflow diffèrent des rôles d'organisation. Par exemple, vous pouvez avoir le rôle *chef d'équipe* dans votre organisation, une affectation qui n'a pas nécessairement une date de fin. Un rôle de workflow, tel que *président de réunion*, a une portée différente et ne s'applique qu'à la durée d'un seul cas.

source: To assign a role to a user task, open the task’s configuration panel, select the `Assignment` tab, and use the `Assign using a role` menu on the right-hand side.
fr: Pour attribuer un rôle à une tâche utilisateur, ouvrez le panneau de configuration de la tâche, sélectionnez l'onglet «Général» et utilisez le menu `Assigner en utilisant un role` sur le côté droit.

source: To assign a role, use the menu to create a new role or select an existing role
fr: Pour attribuer un rôle, utilisez le menu pour créer un nouveau rôle ou sélectionnez un rôle existant

source: You can also use the edit icon next to the role name to rename the role.
fr: Vous pouvez également utiliser l'icône de modification en regard du nom de rôle pour le renommer.

source: Role candidates
fr: Candidats au rôle

source: You can use a role to assign multiple tasks a person from a group of candidates. For example, you might have a support process that includes three user tasks that you assign to a support engineer.
fr: Vous pouvez utiliser un rôle pour assigner plusieurs tâches à une personne d'un groupe de candidats. Par exemple, vous pouvez avoir un processus de support qui inclut trois tâches d'utilisateur que vous assignez à un ingénieur du support.

source: Assigning a task to a *Support engineer* role with candidates Alice and Ben
fr: Attribution d'une tâche à un *Ingénieur du support* don't les candidats sont Alice et Ben

source: Instead, assign the three tasks to a new role called ‘Support engineer’, and add the relevant people as candidates for the role.
fr: Au lieu de cela, assignez les trois tâches à un nouveau rôle appelé «Ingénieur du Support», et ajoutez les personnes concernées en tant que candidats pour le rôle.

source: Creating the first task that has a role will notify all of the candidates for the role. When one of the candidates takes the task, Signavio Workflow will assign the subsequent tasks with the same role to the same person. That helps this person work more efficiently because they have the context knowledge about that case.
fr: La création de la première tâche qui a un rôle avertira tous les candidats pour le rôle. Lorsque l'un des candidats prend la tâche, Signavio Workflow assignera les tâches suivantes avec le même rôle à la même personne. Cela aide cette personne à travailler plus efficacement parce qu'elle connait le contexte de ce cas.

source: If you reassign a task that has a role assignment, Signavio Workflow will update the role variable, and assign all subsequent tasks with the same role to the new assignee.
fr: Si vous réassignez une tâche qui a une attribution de rôle, Signavio Workflow mettra à jour la variable role et assignera toutes les tâches suivantes avec le même rôle au nouveau responsible de la tâche.

source: Using a form field to assign a role
fr: Utilisation d'un champ de formulaire pour attribuer un rôle

source: When you execute a process, you normally assign a specific person to a role by using the assignee button to select someone. Sometimes, you want this assignment to an explicit part of the process, to make sure the assignment happens at the right time. For example, you may find it important to assign the *Support engineer* before completing an *Initial investigation* task.
fr: Lorsque vous exécutez un workflow, vous affectez normalement une personne spécifique à un rôle à l'aide du bouton participant pour sélectionner quelqu'un. Parfois, vous voulez que cette affectation ne se produise que dans une partie explicite du workflow, pour s'assurer que l'affectation ne se passe qu'au bon moment. Par exemple, il peut être important d'assigner un *ingénieur du support* à une tâche avant de démarrer une tâche de *Première analyse*.

source: You can do this by adding the role assignment to a form, because you can use task assignment roles as process variables, just like any other *User* form field.
fr: Pour ce faire, vous pouvez ajouter l'attribution de rôle à un formulaire, car vous pouvez utiliser l'affectation des rôles des tâches comme des variables de workflow, comme tout autre champ de formulaire *utilisateur*.

source: Adding the *Support engineer* role assignment to a form
fr: Ajout de l'assignation du rôle *ingénieur du support* à un formulaire

source: To add a role assignment to a form, first define the process role, such as the *Support engineer* role created above, then on the form, under the *Reuse field* heading, select the role variable to add it to the form.
fr: Pour ajouter une attribution de rôle à un formulaire, définissez d'abord le rôle de workflow, tel que le rôle *ingénieur du support* créé ci-dessus, puis dans le formulaire, sous l'en-tête *réutiliser le champ*, sélectionnez la variable de rôle pour l'ajouter au formulaire.

source: Alternatively, you can first define the *Support engineer* role by adding a field with type *User* to the *Initial investigation* task’s form, and then select the *Support engineer* role on another user task’s *General* configuration.
fr: Vous pouvez également définir d'abord le rôle *ingénieur du support* en ajoutant un champ avec type *utilisateur* au formulaire de la tâche *Première analyse*, puis sélectionnez le rôle *ingénieur du support* dans la configuration d'une autre tâche utilisateur dans l'onglet *général*.

source: Process locking
fr: Verrouillage du workflow

source: In the process builder, only one person can edit a process at a time. While someone continues to edit a process, the `Processes` list shows a message.
fr: Dans le générateur de workflow, une seule personne à la fois peut modifier un workflow. Bien que quelqu'un continue à modifier un workflow, la liste des `Workflow` affiche un message.

source: The `Processes` list message while someone else edits the process
fr: Le message dans la liste des `Workflows` pendant que quelqu'un d’autre édite le workflow

source: You can still open the process, but you will see a warning message explaining that you cannot make changes:
fr: Vous pouvez toujours ouvrir le workflow, mais vous verrez un message d'avertissement expliquant que vous ne pouvez pas apporter des modifications:

source: Warning that you cannot edit a process at the same time as someone else
fr: Avertissement que vous ne pouvez pas modifier un workflow en même temps que quelqu'un d'autre

source: You can edit the process and make changes after the other person leaves the process editor, by opening the `Tasks` list, for example.
fr: Vous pouvez modifier le workflow et apporter des modifications après que l'autre personne ferme l'éditeur de workflow, en ouvrant la liste des `tâches`, par exemple.

source: BPMN import
fr: Importer en BPMN

source: You can import a Signavio Workflow process model from a BPMN 2.0 XML file. You can use this to import a model that you created in another tool, or to load a file that you saved using the :ref:`BPMN export <bpmn-export>` option.
fr: Vous pouvez importer un modèle de workflow Signavio Workflow partir d’un fichier BPMN 2.0 XML. Vous pouvez l’utiliser pour importer un modèle que vous avez créé dans un autre outil, ou pour charger un fichier que vous avez enregistré à l’aide de l'option :ref:`BPMN export <bpmn-export>`.

source: To import a process model, on the `Processes` page, click the `Import BPMN` button and select the BPMN XML file.
fr: Pour importer un modèle de workflow, sur la page `Workflows`, cliquez sur le bouton `Importer en BPMN` et sélectionnez le fichier BPMN XML.

source: The `Import BPMN` button on the `Processes` page
fr: Le bouton `Importer en BPMN` sur la page de `Workflows`

source: Signavio Workflow does not support all BPMN 2.0 elements, so the process may appear differently in Signavio Workflow. The following table lists supported BPMN elements, and the corresponding action type.
fr: Signavio Workflow Accelerator ne prend pas en charge tous les éléments BPMN 2.0, donc le workflow peut apparaître différemment dans Signavio Workflow Accelerator. Le tableau suivant répertorie les éléments BPMN pris en charge et le type d'action correspondant.

source: Supported BPMN elements
fr: Éléments BPMN pris en charge

source: BPMN element
fr: Élément BPMN

source: Action type
fr: Type d'action

source: Business rule task
fr: Tâche de règle métier

source: Call activity
fr: Activité appelante

source: End event
fr: Événement de fin

source: Exclusive gateway
fr: Branchement exclusif

source: Intermediate timer event
fr: Événement de minuterie intermédiaire

source: Manual task
fr: Tâche manuelle

source: Parallel gateway
fr: Branchement parallèle

source: Script task
fr: Tâche Script

source: Send task (``type=email``)
fr: Tâche Envoyer (''type = email'')

source: Service task (``type=changeState``)
fr: Tâche Service (``type=changeState``)

source: Signavio Process Editor state change
fr: Changement de status dans Signavio Process Manager

source: Service task (``type=boxFileUpload``)
fr: Tâche Service (``type=boxFileUpload``)

source: Service task (``type=googleAddCalendarEvent``)
fr: Tâche Service (``type=googleAddCalendarEvent``)

source: Service task (``type=googleCloudPrint``)
fr: Tâche Service (``type=googleCloudPrint``)

source: Service task (``type=googleDriveAddRow``)
fr: Tâche Service (``type=googleDriveAddRow``)

source: Service task (``type=googleDriveFileUpload``)
fr: Tâche Service (``type=googleDriveFileUpload``)

source: Start event
fr: Événement de début

source: Sub-process (embedded)
fr: Sous-processus

source: Swim lanes
fr: Couloirs

source: Task
fr: Tâche

source: User task
fr: Tâche utilisateur

source: Signavio Workflow removes unsupported elements, such as message events.
fr: Signavio Workflow supprime les éléments non pris en charge, tels que les événements de message.

source: BPMN export
fr: Exporter en BPMN

source: You can export a Signavio Workflow process model as a BPMN 2.0 XML file. You may find this useful for opening the model in another tool that supports BPMN, or to make a backup that you can load using the :ref:`BPMN import <bpmn-import>` option.
fr: Vous pouvez exporter un modèle de workflow de Signavio Workflow Accelerator en tant que fichier BPMN 2.0 XML. Cela peut être utile pour ouvrir le modèle dans un autre outil qui prend en charge BPMN, ou pour effectuer une sauvegarde que vous pouvez importer à l'aide de l'option :ref:`Importer en BPMN <bpmn-import>`.

source: To export a process model, first open it in the Signavio Workflow process editor. Select the menu next to the `Publish changes` button, then select `Export BPMN 2.0 XML`.
fr: Pour exporter un modèle de workflow, ouvrez-le d'abord dans l'éditeur de workflow de Signavio Workflow Accelerator. Sélectionnez le menu en regard du bouton `publier les modifications`, puis sélectionnez `Exporter en BPMN 2.0 XML'.

source: Using the `Export BPMN 2.0 XML` option to save a process model in a file
fr: Utilisation de l’option `Exporter en BPMN 2.0 XML' pour enregistrer un modèle de workflow dans un fichier

source: This results in a file download that describes your process model in BPMN format. Signavio Workflow only exports one kind of BPMN file, so it doesn’t give you any options to configure.
fr: Cela se traduit par un téléchargement de fichier qui décrit votre modèle de workflow au format BPMN. Signavio Workflow Accelerator exporte uniquement un type de fichier BPMN, il ne vous donne pas toutes les options de configuration.

source: Copying & deleting processes
fr: Copie & suppression des Workflows

source: You can create a copy of a process or delete it using the process menu shown in the previous section.
fr: Vous pouvez créer une copie d’un workflow ou le supprimer en utilisant le menu de workflow indiqué dans la section précédente.

source: The `Create a copy` option duplicates the process in the same organisation. You may find it useful to duplicate a process if you want to experiment with changes without publishing changes to a live process. You may also want to duplicate a process to model a special case of the process, instead of adding a conditional flow to the standard process.
fr: L’option `Créer une copie` duplique le workflow dans la même organisation. Vous trouverez peut-être utile de dupliquer un workflow si vous souhaitez expérimenter des changements sans pour autant publier des modifications sur un workflow en production. Vous pouvez également dupliquer un workflow pour modéliser un cas particulier d'un workflow, au lieu d’ajouter un flux conditionnel au workflow en cours.

source: The `Delete process` option permanently deletes a process and all of its cases. You cannot undo this operation, so you must enter a confirmation. You might want to delete a process that you created by duplicating another process in order to experiment with changes in the model.
fr: L'option `Supprimer le workflow` supprime définitivement un workflow et tous ses cas. Vous ne pouvez pas annuler cette opération, vous devez donc saisir une confirmation. Vous souhaiterez peut-être supprimer un workflow que vous avez créé en dupliquant un autre workflow à des fins de tests.

source: In Signavio Workflow, you cannot currently delete cases, which you might want to do if you have created test cases while developing the process. However, you can use `Create a copy` and `Delete process` to duplicate a process and then delete the original. This deletes all of the cases with the original process, and leaves a copy with no cases.
fr: Dans Signavio Workflow Accelerator, vous ne pouvez pas actuellement supprimer de cas, ce que vous voudriez peut-être faire si vous avez fait des tests lors du développement d’un workflow. Toutefois, vous pouvez utiliser `créer une copie` d’un workflow pour le dupliquer puis `supprimer` l'original. Cela supprime tous les cas avec du workflow d'origines sans affecter la copie sans cas.
