Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/profile.po
Languages: de, fr

source: My profile
de: Mein Profil
fr: Mon Compte

source: On the top-right drop-down menu, select `My Profile` to view and edit your own Signavio Workflow user settings. The profile page has four sections:
de: Um Ihre persönlichen Signavio Workflow-Einstellungen einzusehen und zu ändern, wählen Sie in der oberen rechten Ecke des Nutzermenüs `Mein Profil`. Ihre Profilseite ist in vier Abschnitte unterteilt:
fr: Dans le menu déroulant en haut à droite, sélectionnez `Mon Compte` pour afficher et modifier vos paramètres utilisateur de Signavio Workflow Accelerator. La page de profil comporte quatre sections:

source: :ref:`Me <me>`
de: :ref:`Ich <me>`
fr: :ref:`Mes informations personnelles <me>`

source: :ref:`Preferences <preferences>`
de: :ref:`Einstellungen <preferences>`
fr: :ref:`Préférences <preferences>`

source: :ref:`Organizations <organizations>`
de: :ref:`Organisationen <organizations>`
fr: :ref:`Organisations <organizations>`

source: Me
de: Ich
fr: Mes informations personnelles

source: Use the `Me` section to update your user profile, including contact details and avatar image, or change your password.
de: Im Abschnitt `Ich` können Sie Ihr Profil bearbeiten. Dazu gehört Ihre Kontaktadresse, sowie Ihr Profilbild. Sie können hier auch Ihr aktuelles Passwort ändern.
fr: Utilisez la section `Mes informations personnelles` pour mettre à jour votre profil utilisateur, y compris vos coordonnées et l'image avatar, ou changez votre mot de passe.

source: Preferences
de: Einstellungen
fr: Préférences

source: Use the `Preferences` section to configure the Signavio Workflow user interface and notifications.
de: In den `Einstellungen` können Sie festlegen in welcher Sprache Sie Signavio Workflow benutzen möchten. Des Weiteren haben Sie hier die Möglichkeit Benachrichtigungen ein- bzw. abzuschalten.
fr: Utilisez la section `Préférences` pour configurer l'interface utilisateur et les notifications de Signavio Workflow Accelerator.

source: Uncheck the checkboxes to disable all email notifications.
de: Um Emailbenachrichtigungen abzuschalten deaktivieren Sie alle Checkboxen.
fr: Décochez les cases à cocher pour désactiver toutes les notifications par courrier électronique.

source: Organizations
de: Organisationen
fr: Organisations

source: The `Organizations` section lists organizations that you belong to, and indicates whether you have the organization administrator role.
de: Unter `Organisationen` sehen Sie alle Organisationen, in denen Sie Mitglied sind. Hier können Sie auch nachvollziehen, in welchen Organisationen Sie Administratorrechte haben.
fr: La section `Organisations` répertorie les organisations auxquelles vous appartenez et indique si vous avez le rôle administrateur de l'organisation.

source: You can use the leave icon to leave an organisation. When you leave an organisation, Signavio Workflow will:
de: Sie können das Verlassen-Icon benutzen, um eine Organisation zu verlassen. Wenn Sie eine Organisation verlassen, wird Signavio Workflow:
fr: Vous pouvez utiliser l'icône *quitter* pour quitter une organisation. Lorsque vous quittez une organisation, Signavio Workflow Accelerator :

source: remove you from the organisation’s groups
de: Sie aus Gruppen der Organisation entfernen
fr: vous retire des groupes de l'organisation

source: remove you from process models (process owner, access controls, action candidates)
de: Sie aus Prozessmodellen entfernen (Eigentümer, Zugriffsrechte, Aktions-Kandidaten)
fr: vous enlèvera des modèles de workflow (propriétaire de workflow, contrôles d'accès, candidats aux actions)

source: unassign you from tasks in the organisation’s processes
de: Sie aus Aufgaben der Prozesse dieser Organisation entfernen
fr: vous enlèvera des tâches dans les workflows de l'organisation

source: remove your participation in cases of the organisation’s processes
de: Ihre Beteiligung an Fällen in Prozessen der Organisation entfernen
fr: supprimera votre participation aux cas des workflows de l’organisation

source: free up one of the organisation’s Signavio Workflow licenses.
de: Ihre Signavio Workflow-Lizenz für die Organisation freigeben
fr: libèrera une des licences Signavio Workflow Accelerator dans l'organisation.

source: The `Services` section shows your personal configurations for third-party services, such as a linked Google Account.
de: Im Bereich `Services` sehen Sie alle Dritt-Services, die Sie persönlich mit Signavio Workflow verknüpft haben. Sie können hier zentral Zugriff auf bestimmte Services mit Ihrem Account zurückziehen.
fr: La section `Services` affiche vos configurations personnelles pour des services tiers, tels qu'un compte Google lié.
