Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/settings.po
Languages: fr

source: Organization settings
fr: Paramètres de l’organisation

source: In Signavio Workflow, your organization represents a collection of Signavio Workflow users - typically a company - together with all their data in Signavio Workflow. People outside your organization cannot see your organization’s data. After you log into Signavio Workflow, you see all the data inside one particular organization. If you belong to multiple organizations, you can switch between organizations by selecting a different organization under your name in the top right corner.
fr: Dans Signavio Workflow Accelerator, votre organisation représente une liste d'utilisateurs de Signavio Workflow Accelerator -généralement une société- ainsi que toutes leurs données. Les personnes extérieures à votre organisation ne peuvent pas voir les données de votre organisation. Une fois que vous vous êtes connecté à Signavio Workflow Accelerator, vous voyez toutes les données à l'intérieur d'une organisation particulière. Si vous appartenez à plusieurs organisations, vous pouvez basculer entre les organisations en sélectionnant une organisation différente sous votre nom dans le coin supérieur droit.

source: Use the Organization settings page to set-up users and groups, manage invitations, and configure external services such as :ref:`salesforce-integration`.
fr: Utilisez la page configuration de l'organisation pour configurer des utilisateurs et des groupes, gérer des invitations et configurer des services externes tels que :ref:`salesforce-integration`.

source: At the top of the page, in the masthead, you can edit the organization name.
fr: En haut de la page, vous pouvez modifier le nom de l’organisation.

source: Users
fr: Utilisateurs

source: The users list shows users who belong to your organization. You can expand each user’s entry to see their email address, license type, and membership type - indicating whether the user has the administrator role.
fr: La liste des utilisateurs affiche les utilisateurs qui appartiennent à votre organisation. Vous pouvez développer l'entrée de chaque utilisateur pour voir son adresse de messagerie, son type de licence et son type d'appartenance - indiquant si l'utilisateur a le rôle d'administrateur.

source: Administrators can promote other users to administrator: on an expanded user panel, click the *Promote to administrator* button.
fr: Les administrateurs peuvent promouvoir d'autres utilisateurs comme administrateur : sur l'affichage déplié de utilisateur, cliquez sur le bouton *Promouvoir en tanque qu'administrateur*.

source: Administrators can also delete users, using the delete button next to the user name.
fr: Les administrateurs peuvent également supprimer des utilisateurs, à l'aide du bouton supprimer en regard du nom d'utilisateur.

source: The invitations list shows who you have invited to use Signavio Workflow.
fr: La liste des invitations indique qui vous avez invité à utiliser Signavio Workflow Accelerator.

source: To invite someone to use Signavio Workflow, select the license they will use, enter their email address in the text field and click the *Invite* button. They will receive an email with a link to the registration page, where they can create a Signavio Workflow user that will become a member of the organization.
fr: Pour inviter des personnes à utiliser Signavio Workflow Accelerator, sélectionnez la licence qu'ils utiliseront, entrez leurs adresses e-mail dans le champ texte et cliquez sur le bouton *Inviter*. Ils recevront un e-mail avec un lien vers la page d'inscription, où ils pourront créer un utilisateur Signavio Workflow Accelerator membre de cette organisation.

source: Groups
fr: Groupes

source: The groups list shows the organization’s user groups. You can use these groups to define candidates for tasks in the :ref:`process builder <process-builder>`.
fr: La liste des groupes affiche les groupes utilisateurs de l'organisation. Vous pouvez utiliser ces groupes pour définir des candidats pour des tâches dans le :ref:`générateur de Workflow <process-builder>`.

source: To create a new group, in the text field below the group list, enter a group name and click the *Create* button.
fr: Pour créer un nouveau groupe, dans le champ texte situé sous la liste groupe, entrez un nom de groupe et cliquez sur le bouton *Créer*.

source: Click a group’s name to expand its list of members, so you can edit the name and add or remove members,
fr: Cliquez sur le nom d'un groupe pour agrandir sa liste de membres, afin que vous puissiez modifier le nom et ajouter ou supprimer des membres,

source: Preferences
fr: Préférences

source: The *Preferences* include additional options that apply to the whole organization.
fr: Les *préférences* incluent des options supplémentaires qui s'appliquent à l'ensemble de l'organisation.

source: *Time zone* affects how Signavio Workflow displays times.
fr: *Fuseau horaire* affecte la façon dont Signavio Workflow Accelerator affiche les temps.

source: *Email signature* replaces the default *Signavio Workflow team* signature at the bottom of :ref:`notification emails <notifications>`.
fr: *Signature des emails* remplace la signature par défaut *L'équipe Signavio Workflow Accelerator* au bas des :ref:`notifications emails <notifications>`.

source: Use the *Services* tab to configure integration with cloud services for members of the organization to use. See :ref:`salesforce-integration`.
fr: Utilisez l'onglet *Services* pour configurer l'intégration avec les services en ligne à utiliser. (Voir :ref:`salesforce-integration`).

source: Billing
fr: Facturation

source: Use the *Billing* tab to manage your organization’s licenses for Signavio Workflow. This page shows:
fr: Utilisez l'onglet *Facturation* pour gérer les licences de votre organisation Signavio Workflow Accelerator. Cette page affiche :

source: the number of remaining user licenses - how many more people you can add to the organization
fr: le nombre de licences utilisateur restantes - combien de personnes supplémentaires vous pouvez ajouter à l'organisation

source: the license expiry date, after which you must renew your licenses to continue using Signavio Workflow.
fr: la date d'expiration de la licence, après laquelle vous devez les renouveler pour continuer à utiliser Signavio Workflow.

source: The left-hand sidebar summarises your current license type. Click the *Upgrade your license* button to upgrade to another license type.
fr: La barre latérale de gauche récapitule votre type de licence en cours. Cliquez sur le bouton *Mettre à niveau votre licence* pour passer à un autre type de licence.
