Repository: FancyGoldfish07/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/tasks.po
Languages: fr

source: Tasks
fr: Tâches

source: A task represents work that someone will presumably complete. :ref:`cases` typically include multiple tasks, usually those that the process defines. You can also add ad-hoc tasks to a case.
fr: Une tâche représente le travail que quelqu'un va vraisemblablement accomplir. Les :ref:`cas` incluent généralement plusieurs tâches, généralement celles que le workflow définit. Vous pouvez également ajouter des tâches ad-hoc à un cas.

source: In Signavio Workflow, you can assign a task to a specific user, set a due date and add subtasks.
fr: Avec Signavio Workflow Accelerator, vous pouvez assigner une tâche à un utilisateur spécifique, définir une date d'échéance et ajouter des tâches subordonnées.

source: Viewing your tasks in the Inbox
fr: Affichage de vos tâches dans "Mes tâches"

source: The *Inbox* shows an overview of your assigned tasks: a list of tasks for you to work on. To open the Inbox, select *Tasks* from the main menu and select the *Inbox* tab.
fr: La vue *Mes tâches* montre une vue d’ensemble de vos tâches assignées : une liste de tâches à accomplir. Pour ouvrir Mes tâches, sélectionnez *Tâches* dans le menu principal et sélectionnez l'onglet *Mes tâches*.

source: The tasks Inbox
fr: Vue de "Mes tâches"

source: Each task shows the assignee - you for all Inbox tasks - and a link to the task itself.
fr: Chaque tâche affiche le participant, "vous" en l'occurrence et un lien vers la tâche elle-même.

source: The left-hand side of the inbox has sections for tasks that have due dates, so you can prioritise your work. The right-hand side lists tasks that don’t have a due date.
fr: Le côté gauche de Mes tâches comporte des sections pour les tâches qui ont des dates limites, de sorte que vous pouvez prioriser votre travail. Le côté droit répertorie les tâches qui n'ont pas de date limite.

source: Viewing all tasks
fr: Affichage de toutes les tâches

source: The *All tasks* view shows tasks for all assignees.
fr: L'affichage *Toutes les tâches* affiche les tâches pour tous les utilisateurs.

source: The list of all tasks
fr: Liste de toutes les tâches

source: Tasks with due dates have a clock indicator to the right of the task name. Signavio Workflow shows this indicator in red when a task’s due date has arrived.
fr: Les tâches avec les dates limites ont un indicateur avec une horloge à droite du nom de la tâche. Signavio Workflow Accelerator affiche cet indicateur en rouge lorsque la date limite d'une tâche est arrivée.

source: You can use the controls on the right to filter the tasks list, which you will find useful when the workload increases.
fr: Vous pouvez utiliser les contrôles à droite pour filtrer la liste des tâches, ce qui est utile lorsque la charge de travail augmente.

source: Task filters
fr: Filtres de tâches

source: The *All tasks* view includes several kinds of task filters, that you can use to manage a long list of tasks.
fr: La vue *Toutes les tâches* comprend plusieurs types de filtres de tâches, que vous pouvez utiliser pour gérer une longue liste de tâches.

source: *Involvement filter* - shows tasks according to how they relate to you, such as tasks you started.
fr: Filtre par *Niveau d'implication* : montre les tâches selon la façon dont elles se rapportent à vous, comme les tâches que vous avez commencées.

source: *Process* filter - shows tasks for a specific process.
fr: *Filtre par workflow* : affiche les tâches d’un workflow spécifique.

source: *Due date* filter - shows tasks according to their due dates, such as only overdue tasks.
fr: Filtre par *Date limite* : montre les tâches selon leur date d’échéance, ou bien celles qui sont en retard.

source: *Completed* filter - shows complete tasks, which the task list normally excludes.
fr: Filtre *Effectuée* : affiche les tâches terminées, que la liste des tâches exclut normalement.

source: *Assignee filter* - shows tasks that have a specific assignee, or tasks that have a specific candidate.
fr: Filtre *Utilisateurs* : affiche des tâches assignées à un utilisateur spécifique ou des tâches ayant un candidat spécifique.

source: Creating case tasks
fr: Création de tâches de cas

source: To create tasks, open a case, and use the tasks list to add a new task. Enter the task title in the text box to create the task.
fr: Pour créer des tâches, ouvrez un cas et utilisez la liste de tâches pour en ajouter une nouvelle. Saisissez le titre de la tâche dans la zone de texte pour la créer.

source: Type the title of the new task and type Enter
fr: Saisissez le titre de la nouvelle tâche et validez avec Entrée

source: After you have added a task, it appears in the list:
fr: Une fois que vous avez ajouté une tâche, elle apparaît dans la liste :

source: When a process starts, Signavio Workflow creates a :ref:`case <cases>` and starts all elements that do not have incoming transitions.
fr: Lorsqu'un processus démarre, Signavio Workflow Accelerator crée un :ref:`cas <cases>` et démarre tous les éléments qui n'ont pas de transition entrante.

source: Assigning tasks
fr: Assignation des tâches

source: You can assign a task to yourself, or someone else, to indicate who you expect to work on the task. The assignee’s :ref:`tasks inbox <tasks-inbox>` lists assigned tasks, and the assignee receives task :ref:`notifications <notifications>` and :ref:`reminders <reminders>`.
fr: Vous pouvez vous assigner une tâche, ou à quelqu'un d'autre. L'utilisateur assigné retrouve une liste de tâches dans :ref:`Mes tâches <tasks-inbox>`, et il reçoit également des :ref:`Notifications <notifications>` et des :ref:`Rappels <reminders>`.

source: You can assign a task from anywhere a task appears in a task list. First, click the assignee button immediately to the left of the task name, to open the list of candidates.
fr: Vous pouvez assigner une tâche à partir de n'importe quelle tâche depuis une liste. Tout d'abord, cliquez sur l'icône de l'utilisateur à gauche du nom de la tâche, pour ouvrir la liste des candidats.

source: Assigning a task
fr: Assignation d'une tâche

source: To assign the task, select a candidate from the list, or type a name or email address to filter it first.
fr: Pour assigner la tâche, sélectionnez un candidat dans la liste, tapez un nom ou une adresse e-mail pour filtrer la liste.

source: Viewing task details
fr: Visualiser les détails de la tâche

source: Selecting a task opens the task details view, which you can use to edit the task name, assign the task, or set a due date. This is where you complete a task’s form, if it has one. You can also add ad hoc subtasks.
fr: Lorsque vous sélectionnez une tâche, elle ouvre une vue détaillée, que vous pouvez utiliser pour modifier le nom de la tâche, assigner la tâche ou définir une date limite. C'est là que vous remplissez le formulaire d'une tâche, si elle en contient un. Vous pouvez également ajouter des tâches ad hoc.

source: Details of a task within a case
fr: Détails d'une tâche dans un cas

source: Setting due dates
fr: Définir les dates limites

source: You can set a task’s due date, so that the assignee’s tasks inbox highlights overdue tasks. To set a task’s due date, open the task, and select the clock icon to open the date selector.
fr: Vous pouvez définir la date d’échéance d'une tâche, afin que la liste Mes tâches mette en évidence les tâches en retard. Pour définir la date d’échéance, ouvrez la tâche, puis sélectionnez l’icône de l’horloge pour ouvrir le sélecteur de date.

source: Setting a task’s due date
fr: Définir la date d’échéance de la tâche

source: As well as setting the due date manually, in an open case, you can also set a user task’s default due date in the process editor, on the user task’s :ref:`reminders <reminders>` tab.
fr: Vous pouvez également définir par défaut une date limite d'une tâche depuis l'éditeur de workflows sur l'onglet :ref:`Rappels <reminders>` de la tâche.

source: Completing tasks
fr: Accomplir les tâches

source: Use the highlighted `Done` button (the square on the green background) to complete a task.
fr: Utilisez le bouton surligné «Terminé» (le carré sur fond vert) pour compléter une tâche.

source: When tasks have a form, the task page displays the form in the same position and includes the button(s) to complete the task at the bottom of the form. The task page normally only includes a `Done` button, but will display multiple buttons when you use a decision. Each of those buttons will register the decision and complete the task in one go.
fr: Lorsque les tâches ont un formulaire, celui-ci s’affiche dans la page tâche, ainsi que les boutons pour accomplir la tâche. Cette page ne contient normalement que le bouton « Terminé », mais affichera plusieurs boutons lorsque vous utilisez une décision. Chacun de ces boutons enregistrera la décision et terminera la tâche en une seule fois.

source: Reopening tasks
fr: Réouverture des tâches

source: When the task page shows a `Reopen` button, it means that someone completed the task but you can reopen it. You cannot reopen a task that has a form, because completing the task finalises the form data. You may want to reopen a task that you closed a task by accident, or when you learn about additional work that belongs to this task. If you just forgot to attach a document or make a comment, you can still do that without reopening the task.
fr: Lorsque la page de tâches affiche un bouton «rouvrir», cela signifie que quelqu'un a complété la tâche, mais vous pouvez la rouvrir. Vous ne pouvez pas rouvrir une tâche qui a un formulaire, car l'achèvement de la tâche finalise les données de formulaire. Vous souhaiterez peut-être rouvrir une tâche que vous avez fermée par accident, ou lorsque vous avez un travail supplémentaire lié à cette tâche. Si vous avez simplement oublié de joindre un document ou de faire un commentaire, vous pouvez toujours le faire sans rouvrir la tâche.

source: Reopening a task instead of creating a new task has the advantage that the existing task retains its context.
fr: Rouvrir une tâche plutôt que d'en créer une nouvelle vous permet de conserver le contexte.
